
taos> select cols(last(ts), ts) from testdb.tbd;
           ts            |
==========================
 2021-05-11 10:12:29.000 |

taos> select cols(last_row(f2), ts) from testdb.tb1;
           ts            |
==========================
 2021-05-12 10:10:12.000 |

taos> select cols(last(f2), ts, f1, f2, f3) from testdb.tb1;
           ts            |     f1      |            f2             |      f3      |
===================================================================================
 2021-05-10 10:10:11.000 |           4 |                         5 | NULL         |

taos> select ts, last(f1) from testdb.tbn interval(1s);
           ts            |  last(f1)   |
========================================
 2021-05-09 10:10:10.000 |           1 |
 2021-05-10 10:10:11.000 |           4 |
 2021-05-12 10:10:12.000 |           6 |

taos> select last(f1), count(*) from testdb.tbn interval(1s);
  last(f1)   |       count(*)        |
======================================
           1 |                     1 |
           4 |                     1 |
           6 |                     1 |
 NULL        |                     1 |

taos> select cols(last(f1), ts), cols(last(f2), ts) from testdb.tbn;
           ts            |           ts            |
====================================================
 2021-05-12 10:10:12.000 | 2021-05-10 10:10:11.000 |

taos> select cols(last(f1), ts), cols(last_row(f3), ts) from testdb.tbn;
           ts            |           ts            |
====================================================
 2021-05-12 10:10:12.000 | 2021-05-13 10:10:12.000 |

taos> select cols(last(f2), ts), cols(first(f3), ts) from testdb.tbn;
           ts            |           ts            |
====================================================
 2021-05-10 10:10:11.000 | 2021-05-09 10:10:10.000 |

taos> select cols(last(f3), ts), cols(max(f1), ts) from testdb.tbn;
           ts            |           ts            |
====================================================
 2021-05-09 10:10:10.000 | 2021-05-12 10:10:12.000 |

taos> select last(*), tbname from testdb.st2 group by tbname order by tbname;
        last(ts)         |  last(f1)   |         last(f2)          |   last(f3)   |        last(f4)         |             tbname             |
==============================================================================================================================================
 2021-05-12 10:10:12.000 |           6 |                         5 | 3            | 1970-01-01 07:59:57.000 | tb1                            |
 2021-05-11 10:11:15.000 |          -6 |                        -7 | -8           | 1970-01-01 07:59:56.999 | tb2                            |
 2021-05-09 10:12:18.000 |          12 |                         8 | 9            | 1970-01-01 07:59:56.998 | tb3                            |
 2021-05-11 10:12:21.000 |          18 |                        17 | 15           | 1970-01-01 07:59:56.997 | tb4                            |
 2021-05-09 10:12:22.000 |          19 |                        20 | 21           | 1970-01-01 07:59:58.996 | tb5                            |
 2021-05-11 10:12:23.000 |          22 |                        23 | NULL         | 1970-01-01 07:59:57.996 | tb6                            |
 2021-05-10 10:12:24.000 |          24 | NULL                      | 25           | 1970-01-01 07:59:56.996 | tb7                            |
 2021-05-11 10:12:25.000 |          26 | NULL                      | 27           | 1970-01-01 07:59:55.996 | tb8                            |
 2021-05-09 10:12:26.009 |          28 |                        29 | 30           | 1970-01-01 07:59:58.995 | tb9                            |
 2021-05-10 10:12:27.000 |          31 |                        32 | NULL         | 1970-01-01 07:59:57.995 | tba                            |
 2021-05-10 10:12:28.000 |          33 | NULL                      | 35           | 1970-01-01 07:59:56.995 | tbb                            |
 2021-05-11 10:12:29.000 |          36 |                        37 | NULL         | 1970-01-01 07:59:55.995 | tbc                            |
 2021-05-11 10:12:29.000 | NULL        | NULL                      | NULL         | NULL                    | tbd                            |

taos> select cols(last(f1), ts, f1), tbname from testdb.st2 group by tbname order by tbname;
           ts            |     f1      |             tbname             |
=========================================================================
 2021-05-12 10:10:12.000 |           6 | tb1                            |
 2021-05-11 10:11:15.000 |          -6 | tb2                            |
 2021-05-09 10:12:18.000 |          12 | tb3                            |
 2021-05-11 10:12:21.000 |          18 | tb4                            |
 2021-05-09 10:12:22.000 |          19 | tb5                            |
 2021-05-11 10:12:23.000 |          22 | tb6                            |
 2021-05-10 10:12:24.000 |          24 | tb7                            |
 2021-05-11 10:12:25.000 |          26 | tb8                            |
 2021-05-09 10:12:26.009 |          28 | tb9                            |
 2021-05-10 10:12:27.000 |          31 | tba                            |
 2021-05-10 10:12:28.000 |          33 | tbb                            |
 2021-05-11 10:12:29.000 |          36 | tbc                            |
 NULL                    | NULL        | tbd                            |

taos> select last_row(f3), tbname from testdb.st2 group by tbname order by tbname;
 last_row(f3) |             tbname             |
================================================
 NULL         | tb1                            |
 -8           | tb2                            |
 NULL         | tb3                            |
 NULL         | tb4                            |
 21           | tb5                            |
 NULL         | tb6                            |
 25           | tb7                            |
 27           | tb8                            |
 30           | tb9                            |
 NULL         | tba                            |
 35           | tbb                            |
 NULL         | tbc                            |
 NULL         | tbd                            |

taos> select last(f3), tbname from testdb.st2 group by tbname order by tbname
   last(f3)   |             tbname             |
================================================
 3            | tb1                            |
 -8           | tb2                            |
 9            | tb3                            |
 15           | tb4                            |
 21           | tb5                            |
 NULL         | tb6                            |
 25           | tb7                            |
 27           | tb8                            |
 30           | tb9                            |
 NULL         | tba                            |
 35           | tbb                            |
 NULL         | tbc                            |
 NULL         | tbd                            |

