
taos> select date(0)
            date(0)             |
=================================
 1970-01-01                     |

taos> select date(cast(timestamp"2025-08-11 23:03:39" as bigint))
 date(cast(timestamp"2025-08-11 23:03:39" as bigint)) |
=======================================================
 2025-08-11                                           |

taos> select date("2025-08-11 12:00:02.000")
 date("2025-08-11 12:00:02.000") |
==================================
 2025-08-11                      |

taos> select date("9999-12-31")
       date("9999-12-31")       |
=================================
 9999-12-31                     |

taos> select date("01/01/2026")
       date("01/01/2026")       |
=================================
 NULL                           |

taos> select date("01-JAN-25")
       date("01-JAN-25")        |
=================================
 NULL                           |

taos> select groupid, date(last(ts)) from ts_4893.meters group by groupid
 groupid |         date(last(ts))         |
===========================================
       1 | 2027-01-15                     |

