
taos> select VAR_POP(current) from ts_4893.meters
     var_pop(current)      |
============================
          1.33250006771082 |

taos> select VAR_POP(current) from ts_4893.meters interval(1d) order by 1 limit 10
     var_pop(current)      |
============================
          0.70270236872882 |
           0.7033161874832 |
         0.705108381402508 |
         0.705108381402508 |
         0.706550970594425 |
         0.713307092277611 |
         0.716868426325289 |
         0.717430199108789 |
         0.717718701247475 |
         0.719483011074183 |

taos> select VAR_POP(id) from ts_4893.meters
        var_pop(id)        |
============================
          8333333.24999998 |

taos> select VAR_POP(id) from ts_4893.meters interval(1d) limit 10
        var_pop(id)        |
============================
                     21.25 |
                        70 |
                        70 |
                        70 |
                        70 |
                     65.25 |
                        70 |
                        70 |
                        70 |
                        70 |

taos> select VAR_POP(id) from ts_4893.meters where id > 100
        var_pop(id)        |
============================
          8165849.99999995 |

taos> select VAR_POP(id) from ts_4893.meters interval(1d) order by 1 limit 10
        var_pop(id)        |
============================
                     21.25 |
                        30 |
                     65.25 |
                     65.25 |
                     65.25 |
                     65.25 |
                     65.25 |
                     65.25 |
                     65.25 |
                     65.25 |

taos> select var_pop(null) from ts_4893.meters
       var_pop(null)       |
============================
 NULL                      |

taos> select var_pop(id) from ts_4893.d0
        var_pop(id)        |
============================
          8333333.24999998 |

taos> select var_pop(current) from ts_4893.d0
     var_pop(current)      |
============================
          1.33250006771082 |

taos> select var_pop(voltage) from ts_4893.meters
     var_pop(voltage)      |
============================
          8.27402043999999 |

taos> select var_pop(voltage) from ts_4893.meters where voltage is not null
     var_pop(voltage)      |
============================
          8.27402043999999 |

taos> select var_pop(phase) from ts_4893.meters
      var_pop(phase)       |
============================
        0.0832873384334247 |

taos> select var_pop(phase) from ts_4893.meters where ts between '2023-01-01 00:00:00' and '2023-12-31 23:59:59'
      var_pop(phase)       |
============================
        0.0829874118660322 |

taos> select var_pop(total_voltage) from (select sum(voltage) as total_voltage from ts_4893.meters group by location)
  var_pop(total_voltage)   |
============================
                         0 |

taos> select round(var_pop(current), 2) from ts_4893.meters
 round(var_pop(current), 2) |
=============================
                       1.33 |

taos> select pow(var_pop(current), 2) from ts_4893.meters
 pow(var_pop(current), 2)  |
============================
          1.77555643044935 |

taos> select log(var_pop(voltage) + 1) from ts_4893.meters
 log(var_pop(voltage) + 1) |
============================
          2.22721698997805 |

taos> select groupid, var_pop(voltage) from ts_4893.meters group by groupid order by groupid
 groupid |     var_pop(voltage)      |
======================================
       1 |          8.27402043999999 |

taos> select location, var_pop(current) from ts_4893.meters group by location order by location
      location      |     var_pop(current)      |
=================================================
 beijing            |          1.33250006771082 |

taos> select location, var_pop(voltage) from ts_4893.meters group by location order by location
      location      |     var_pop(voltage)      |
=================================================
 beijing            |          8.27402043999999 |

