
taos> select RADIANS(0)
        radians(0)         |
============================
                         0 |

taos> select RADIANS(1)
        radians(1)         |
============================
        0.0174532925199433 |

taos> select RADIANS(1.5)
       radians(1.5)        |
============================
        0.0261799387799149 |

taos> select RADIANS(100)
       radians(100)        |
============================
          1.74532925199433 |

taos> select RADIANS(-1)
        radians(-1)        |
============================
       -0.0174532925199433 |

taos> select RADIANS(-1.5)
       radians(-1.5)       |
============================
       -0.0261799387799149 |

taos> select RADIANS(-100)
       radians(-100)       |
============================
         -1.74532925199433 |

taos> select RADIANS(1) + 1
      radians(1) + 1       |
============================
          1.01745329251994 |

taos> select RADIANS(1) - 1
      radians(1) - 1       |
============================
        -0.982546707480057 |

taos> select RADIANS(1) * 1
      radians(1) * 1       |
============================
        0.0174532925199433 |

taos> select RADIANS(1) / 1
      radians(1) / 1       |
============================
        0.0174532925199433 |

taos> select RADIANS(1) from ts_4893.meters limit 5
        radians(1)         |
============================
        0.0174532925199433 |
        0.0174532925199433 |
        0.0174532925199433 |
        0.0174532925199433 |
        0.0174532925199433 |

taos> select RADIANS(1) + 1 from ts_4893.meters limit 1
      radians(1) + 1       |
============================
          1.01745329251994 |

taos> select RADIANS(1) - 1 from ts_4893.meters limit 1
      radians(1) - 1       |
============================
        -0.982546707480057 |

taos> select RADIANS(1) * 2 from ts_4893.meters limit 1
      radians(1) * 2       |
============================
        0.0349065850398866 |

taos> select RADIANS(1) / 2 from ts_4893.meters limit 1
      radians(1) / 2       |
============================
       0.00872664625997165 |

taos> select RADIANS(2) + RADIANS(1) from ts_4893.meters limit 1
  radians(2) + radians(1)  |
============================
        0.0523598775598299 |

taos> select RADIANS(2) - RADIANS(1) from ts_4893.meters limit 1
  radians(2) - radians(1)  |
============================
        0.0174532925199433 |

taos> select RADIANS(2) * RADIANS(1) from ts_4893.meters limit 1
  radians(2) * radians(1)  |
============================
      0.000609234839573417 |

taos> select RADIANS(2) / RADIANS(1) from ts_4893.meters limit 1
  radians(2) / radians(1)  |
============================
                         2 |

taos> select RADIANS(1) + id from ts_4893.meters order by ts limit 5
      radians(1) + id      |
============================
        0.0174532925199433 |
          1.01745329251994 |
          2.01745329251994 |
          3.01745329251994 |
          4.01745329251994 |

taos> select RADIANS(id) + id from ts_4893.meters order by ts limit 5
     radians(id) + id      |
============================
                         0 |
          1.01745329251994 |
          2.03490658503989 |
          3.05235987755983 |
          4.06981317007977 |

taos> select RADIANS(abs(10))
     radians(abs(10))      |
============================
         0.174532925199433 |

taos> select RADIANS(DEGREES(PI()))
  radians(degrees(pi()))   |
============================
          3.14159265358979 |

taos> select abs(RADIANS(10))
     abs(radians(10))      |
============================
         0.174532925199433 |

taos> select pow(RADIANS(10), 2)
    pow(radians(10), 2)    |
============================
        0.0304617419786709 |

taos> select sqrt(RADIANS(10))
     sqrt(radians(10))     |
============================
         0.417771379105167 |

taos> select cast(RADIANS(10) as int)
 cast(radians(10) as int) |
===========================
                        0 |

taos> select RADIANS(sqrt(id)) from ts_4893.meters order by ts limit 5
     radians(sqrt(id))     |
============================
                         0 |
        0.0174532925199433 |
        0.0246826829897687 |
        0.0302299894039036 |
        0.0349065850398866 |

taos> select radians(180)
       radians(180)        |
============================
          3.14159265358979 |

taos> select radians(current) from ts_4893.d0 order by ts limit 10
     radians(current)      |
============================
         0.185877558679493 |
         0.149644536324422 |
         0.170955001564425 |
         0.196052831414414 |
         0.186854955444309 |
         0.148492619284422 |
         0.167481790094528 |
         0.191322990739406 |
         0.195930658899406 |
         0.180414682914441 |

taos> select radians(current) from ts_4893.meters order by ts limit 10
     radians(current)      |
============================
         0.185877558679493 |
         0.149644536324422 |
         0.170955001564425 |
         0.196052831414414 |
         0.186854955444309 |
         0.148492619284422 |
         0.167481790094528 |
         0.191322990739406 |
         0.195930658899406 |
         0.180414682914441 |

taos> select radians(null)
       radians(null)       |
============================
 NULL                      |

taos> select radians(0)
        radians(0)         |
============================
                         0 |

taos> select radians(45)
        radians(45)        |
============================
         0.785398163397448 |

taos> select radians(-45)
       radians(-45)        |
============================
        -0.785398163397448 |

taos> select radians(90)
        radians(90)        |
============================
           1.5707963267949 |

taos> select radians(-90)
       radians(-90)        |
============================
          -1.5707963267949 |

taos> select radians(360)
       radians(360)        |
============================
          6.28318530717959 |

taos> select radians(1000000)
     radians(1000000)      |
============================
          17453.2925199433 |

taos> select radians(sin(1))
      radians(sin(1))      |
============================
         0.014686439244897 |

taos> select radians(cos(1))
      radians(cos(1))      |
============================
       0.00943005419351652 |

taos> select radians(tan(1))
      radians(tan(1))      |
============================
        0.0271818925912213 |

taos> select radians(degrees(90))
   radians(degrees(90))    |
============================
                        90 |

taos> select radians(atan(1))
     radians(atan(1))      |
============================
        0.0137077838904019 |

taos> select radians(current) from ts_4893.meters limit 1
     radians(current)      |
============================
         0.185877558679493 |

taos> select radians(voltage) from ts_4893.meters limit 1
     radians(voltage)      |
============================
          3.85717764690747 |

taos> select radians(phase) from ts_4893.meters limit 1
      radians(phase)       |
============================
        0.0088819460022261 |

