
taos> select TIMEDIFF(1,2)
     timediff(1,2)     |
========================
                 -1000 |

taos> select TIMEDIFF(2,1)
     timediff(2,1)     |
========================
                  1000 |

taos> select TIMEDIFF(1,2,1s)
   timediff(1,2,1s)    |
========================
                    -1 |

taos> select TIMEDIFF(2,1,1s)
   timediff(2,1,1s)    |
========================
                     1 |

taos> select TIMEDIFF(1,10000000,1m)
 timediff(1,10000000,1m) |
==========================
                 -166666 |

taos> select TIMEDIFF(10000000,1,1m)
 timediff(10000000,1,1m) |
==========================
                  166666 |

taos> select TIMEDIFF(1,10000000,1h)
 timediff(1,10000000,1h) |
==========================
                   -2777 |

taos> select TIMEDIFF(10000000,1,1h)
 timediff(10000000,1,1h) |
==========================
                    2777 |

taos> select TIMEDIFF(1,10000000,1d)
 timediff(1,10000000,1d) |
==========================
                    -115 |

taos> select TIMEDIFF(10000000,1,1d)
 timediff(10000000,1,1d) |
==========================
                     115 |

taos> select TIMEDIFF(1,10000000,1w)
 timediff(1,10000000,1w) |
==========================
                     -16 |

taos> select TIMEDIFF(10000000,1,1w)
 timediff(10000000,1,1w) |
==========================
                      16 |

taos> select TIMEDIFF(1724404450,1725095657)
 timediff(1724404450,1725095657) |
==================================
                      -691207000 |

taos> select TIMEDIFF(1725095657,1724404450)
 timediff(1725095657,1724404450) |
==================================
                       691207000 |

taos> select TIMEDIFF(1724404450,1725095657,1s)
 timediff(1724404450,1725095657,1s) |
=====================================
                            -691207 |

taos> select TIMEDIFF(1725095657,1724404450,1s)
 timediff(1725095657,1724404450,1s) |
=====================================
                             691207 |

taos> select TIMEDIFF(1724404450,1725095657,1m)
 timediff(1724404450,1725095657,1m) |
=====================================
                             -11520 |

taos> select TIMEDIFF(1725095657,1724404450,1m)
 timediff(1725095657,1724404450,1m) |
=====================================
                              11520 |

taos> select TIMEDIFF(1724404450,1725095657,1h)
 timediff(1724404450,1725095657,1h) |
=====================================
                               -192 |

taos> select TIMEDIFF(1725095657,1724404450,1h)
 timediff(1725095657,1724404450,1h) |
=====================================
                                192 |

taos> select TIMEDIFF(1724404450,1725095657,1d)
 timediff(1724404450,1725095657,1d) |
=====================================
                                 -8 |

taos> select TIMEDIFF(1725095657,1724404450,1d)
 timediff(1725095657,1724404450,1d) |
=====================================
                                  8 |

taos> select TIMEDIFF(1724404450,1725095657,1w)
 timediff(1724404450,1725095657,1w) |
=====================================
                                 -1 |

taos> select TIMEDIFF(1725095657,1724404450,1w)
 timediff(1725095657,1724404450,1w) |
=====================================
                                  1 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17')
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17') |
=========================================================
                                             -691200000 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17')
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17') |
=========================================================
                                              691200000 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1s)
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1s) |
=============================================================
                                                    -691200 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1s)
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1s) |
=============================================================
                                                     691200 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1m)
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1m) |
=============================================================
                                                     -11520 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1m)
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1m) |
=============================================================
                                                      11520 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1h)
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1h) |
=============================================================
                                                       -192 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1h)
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1h) |
=============================================================
                                                        192 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1d)
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1d) |
=============================================================
                                                         -8 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1d)
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1d) |
=============================================================
                                                          8 |

taos> select TIMEDIFF('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1w)
 timediff('2024-08-23 17:14:17', '2024-08-31 17:14:17', 1w) |
=============================================================
                                                         -1 |

taos> select TIMEDIFF('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1w)
 timediff('2024-08-31 17:14:17', '2024-08-23 17:14:17', 1w) |
=============================================================
                                                          1 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657)
 timediff('2024-08-23 17:14:17', 1725095657) |
==============================================
                                  -691200000 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17')
 timediff(1725095657, '2024-08-23 17:14:17') |
==============================================
                                   691200000 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657, 1s)
 timediff('2024-08-23 17:14:17', 1725095657, 1s) |
==================================================
                                         -691200 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17', 1s)
 timediff(1725095657, '2024-08-23 17:14:17', 1s) |
==================================================
                                          691200 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657, 1m)
 timediff('2024-08-23 17:14:17', 1725095657, 1m) |
==================================================
                                          -11520 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17', 1m)
 timediff(1725095657, '2024-08-23 17:14:17', 1m) |
==================================================
                                           11520 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657, 1h)
 timediff('2024-08-23 17:14:17', 1725095657, 1h) |
==================================================
                                            -192 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17', 1h)
 timediff(1725095657, '2024-08-23 17:14:17', 1h) |
==================================================
                                             192 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657, 1d)
 timediff('2024-08-23 17:14:17', 1725095657, 1d) |
==================================================
                                              -8 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17', 1d)
 timediff(1725095657, '2024-08-23 17:14:17', 1d) |
==================================================
                                               8 |

taos> select TIMEDIFF('2024-08-23 17:14:17', 1725095657, 1w)
 timediff('2024-08-23 17:14:17', 1725095657, 1w) |
==================================================
                                              -1 |

taos> select TIMEDIFF(1725095657, '2024-08-23 17:14:17', 1w)
 timediff(1725095657, '2024-08-23 17:14:17', 1w) |
==================================================
                                               1 |

taos> select TIMEDIFF(ts, ts) from ts_4893.meters order by ts limit 10
   timediff(ts, ts)    |
========================
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |
                     0 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17') from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17') |
======================================
                       -225095657000 |
                       -225092657000 |
                       -225089657000 |
                       -225086657000 |
                       -225083657000 |
                       -225080657000 |
                       -225077657000 |
                       -225074657000 |
                       -225071657000 |
                       -225068657000 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts) |
======================================
                        225095657000 |
                        225092657000 |
                        225089657000 |
                        225086657000 |
                        225083657000 |
                        225080657000 |
                        225077657000 |
                        225074657000 |
                        225071657000 |
                        225068657000 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17', 1s) from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17', 1s) |
==========================================
                              -225095657 |
                              -225092657 |
                              -225089657 |
                              -225086657 |
                              -225083657 |
                              -225080657 |
                              -225077657 |
                              -225074657 |
                              -225071657 |
                              -225068657 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts, 1s) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts, 1s) |
==========================================
                               225095657 |
                               225092657 |
                               225089657 |
                               225086657 |
                               225083657 |
                               225080657 |
                               225077657 |
                               225074657 |
                               225071657 |
                               225068657 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17', 1m) from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17', 1m) |
==========================================
                                -3751594 |
                                -3751544 |
                                -3751494 |
                                -3751444 |
                                -3751394 |
                                -3751344 |
                                -3751294 |
                                -3751244 |
                                -3751194 |
                                -3751144 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts, 1m) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts, 1m) |
==========================================
                                 3751594 |
                                 3751544 |
                                 3751494 |
                                 3751444 |
                                 3751394 |
                                 3751344 |
                                 3751294 |
                                 3751244 |
                                 3751194 |
                                 3751144 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17', 1h) from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17', 1h) |
==========================================
                                  -62526 |
                                  -62525 |
                                  -62524 |
                                  -62524 |
                                  -62523 |
                                  -62522 |
                                  -62521 |
                                  -62520 |
                                  -62519 |
                                  -62519 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts, 1h) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts, 1h) |
==========================================
                                   62526 |
                                   62525 |
                                   62524 |
                                   62524 |
                                   62523 |
                                   62522 |
                                   62521 |
                                   62520 |
                                   62519 |
                                   62519 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17', 1d) from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17', 1d) |
==========================================
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2605 |
                                   -2604 |
                                   -2604 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts, 1d) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts, 1d) |
==========================================
                                    2605 |
                                    2605 |
                                    2605 |
                                    2605 |
                                    2605 |
                                    2605 |
                                    2605 |
                                    2605 |
                                    2604 |
                                    2604 |

taos> select TIMEDIFF(ts, '2024-08-31 17:14:17', 1w) from ts_4893.meters order by ts limit 10
 timediff(ts, '2024-08-31 17:14:17', 1w) |
==========================================
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |
                                    -372 |

taos> select TIMEDIFF('2024-08-31 17:14:17', ts, 1w) from ts_4893.meters order by ts limit 10
 timediff('2024-08-31 17:14:17', ts, 1w) |
==========================================
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |
                                     372 |

taos> select TIMEDIFF(ts, 1725095657) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657) |
===========================
            -225095657000 |
            -225092657000 |
            -225089657000 |
            -225086657000 |
            -225083657000 |
            -225080657000 |
            -225077657000 |
            -225074657000 |
            -225071657000 |
            -225068657000 |

taos> select TIMEDIFF(1725095657, ts) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts) |
===========================
             225095657000 |
             225092657000 |
             225089657000 |
             225086657000 |
             225083657000 |
             225080657000 |
             225077657000 |
             225074657000 |
             225071657000 |
             225068657000 |

taos> select TIMEDIFF(ts, 1725095657, 1s) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657, 1s) |
===============================
                   -225095657 |
                   -225092657 |
                   -225089657 |
                   -225086657 |
                   -225083657 |
                   -225080657 |
                   -225077657 |
                   -225074657 |
                   -225071657 |
                   -225068657 |

taos> select TIMEDIFF(1725095657, ts, 1s) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts, 1s) |
===============================
                    225095657 |
                    225092657 |
                    225089657 |
                    225086657 |
                    225083657 |
                    225080657 |
                    225077657 |
                    225074657 |
                    225071657 |
                    225068657 |

taos> select TIMEDIFF(ts, 1725095657, 1m) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657, 1m) |
===============================
                     -3751594 |
                     -3751544 |
                     -3751494 |
                     -3751444 |
                     -3751394 |
                     -3751344 |
                     -3751294 |
                     -3751244 |
                     -3751194 |
                     -3751144 |

taos> select TIMEDIFF(1725095657, ts, 1m) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts, 1m) |
===============================
                      3751594 |
                      3751544 |
                      3751494 |
                      3751444 |
                      3751394 |
                      3751344 |
                      3751294 |
                      3751244 |
                      3751194 |
                      3751144 |

taos> select TIMEDIFF(ts, 1725095657, 1h) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657, 1h) |
===============================
                       -62526 |
                       -62525 |
                       -62524 |
                       -62524 |
                       -62523 |
                       -62522 |
                       -62521 |
                       -62520 |
                       -62519 |
                       -62519 |

taos> select TIMEDIFF(1725095657, ts, 1h) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts, 1h) |
===============================
                        62526 |
                        62525 |
                        62524 |
                        62524 |
                        62523 |
                        62522 |
                        62521 |
                        62520 |
                        62519 |
                        62519 |

taos> select TIMEDIFF(ts, 1725095657, 1d) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657, 1d) |
===============================
                        -2605 |
                        -2605 |
                        -2605 |
                        -2605 |
                        -2605 |
                        -2605 |
                        -2605 |
                        -2605 |
                        -2604 |
                        -2604 |

taos> select TIMEDIFF(1725095657, ts, 1d) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts, 1d) |
===============================
                         2605 |
                         2605 |
                         2605 |
                         2605 |
                         2605 |
                         2605 |
                         2605 |
                         2605 |
                         2604 |
                         2604 |

taos> select TIMEDIFF(ts, 1725095657, 1w) from ts_4893.meters order by ts limit 10
 timediff(ts, 1725095657, 1w) |
===============================
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |
                         -372 |

taos> select TIMEDIFF(1725095657, ts, 1w) from ts_4893.meters order by ts limit 10
 timediff(1725095657, ts, 1w) |
===============================
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |
                          372 |

taos> select timediff('2022-01-01 08:00:00', '2022-01-01 08:00:10',1s)
 timediff('2022-01-01 08:00:00', '2022-01-01 08:00:10',1s) |
============================================================
                                                       -10 |

taos> select timediff('2023-01-01 08:00:00', '2022-01-01 08:00:00',1s)
 timediff('2023-01-01 08:00:00', '2022-01-01 08:00:00',1s) |
============================================================
                                                  31536000 |

taos> select timediff('2022-01-01 08:00:03', '2022-01-01 08:00:00',1a)
 timediff('2022-01-01 08:00:03', '2022-01-01 08:00:00',1a) |
============================================================
                                                      3000 |

taos> select timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1m)
 timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1m) |
============================================================
                                                     43200 |

taos> select timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1h)
 timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1h) |
============================================================
                                                       720 |

taos> select timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1d)
 timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1d) |
============================================================
                                                        30 |

taos> select timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1w)
 timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00',1w) |
============================================================
                                                         4 |

taos> select timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00')
 timediff('2022-01-31 08:00:00', '2022-01-01 08:00:00') |
=========================================================
                                             2592000000 |

taos> select timediff('2022-01-31 08:00:0', '2022-01-01 08:00:00',1s)
 timediff('2022-01-31 08:00:0', '2022-01-01 08:00:00',1s) |
===========================================================
                                                  2592000 |

taos> select timediff('2022-01-31', '2022-01-01',1s)
 timediff('2022-01-31', '2022-01-01',1s) |
==========================================
                                 2592000 |

taos> select timediff(1720769589, 1720769529, 1s)
 timediff(1720769589, 1720769529, 1s) |
=======================================
                                   60 |

taos> select timediff(1720769589, '2022-01-01 08:00:00', 1s)
 timediff(1720769589, '2022-01-01 08:00:00', 1s) |
==================================================
                                        79774389 |

taos> select timediff(1720769589123, 1720769529123, 1s)
 timediff(1720769589123, 1720769529123, 1s) |
=============================================
                                         60 |

taos> select timediff(1720769589231, '2022-01-01 08:00:00', 1s)
 timediff(1720769589231, '2022-01-01 08:00:00', 1s) |
=====================================================
                                           79774389 |

taos> select timediff('2022-01-01 08:00:00', 1720769589, 1s)
 timediff('2022-01-01 08:00:00', 1720769589, 1s) |
==================================================
                                       -79774389 |

taos> select timediff('2022-01-01 08:00:00', 1720769589123, 1s)
 timediff('2022-01-01 08:00:00', 1720769589123, 1s) |
=====================================================
                                          -79774389 |

taos> select timediff(ts, 1720769589123, 1a) from ts_4893.d0 order by ts limit 10
 timediff(ts, 1720769589123, 1a) |
==================================
                   -220769589123 |
                   -220766589123 |
                   -220763589123 |
                   -220760589123 |
                   -220757589123 |
                   -220754589123 |
                   -220751589123 |
                   -220748589123 |
                   -220745589123 |
                   -220742589123 |

taos> select timediff(ts, 1720769589123, 1a) from ts_4893.meters order by ts limit 10
 timediff(ts, 1720769589123, 1a) |
==================================
                   -220769589123 |
                   -220766589123 |
                   -220763589123 |
                   -220760589123 |
                   -220757589123 |
                   -220754589123 |
                   -220751589123 |
                   -220748589123 |
                   -220745589123 |
                   -220742589123 |

taos> select timediff(null, '2022-01-01 08:00:01', 1s)
 timediff(null, '2022-01-01 08:00:01', 1s) |
============================================
 NULL                                      |

taos> select timediff('20220131', '20220101', 1s)
 timediff('20220131', '20220101', 1s) |
=======================================
 NULL                                 |

taos> select timediff('01/31/22', '01/01/22', 1s)
 timediff('01/31/22', '01/01/22', 1s) |
=======================================
 NULL                                 |

taos> select timediff('22/01/31', '22/01/01')
 timediff('22/01/31', '22/01/01') |
===================================
 NULL                             |

taos> select timediff('22/01/31', '22/01/01', 1s)
 timediff('22/01/31', '22/01/01', 1s) |
=======================================
 NULL                                 |

taos> select timediff('31-JAN-22', '01-JAN-22', 1s)
 timediff('31-JAN-22', '01-JAN-22', 1s) |
=========================================
 NULL                                   |

taos> select timediff('2022/01/31', '2022/01/01', 1s)
 timediff('2022/01/31', '2022/01/01', 1s) |
===========================================
 NULL                                     |

taos> select timediff('2022-01-01 08:00:00', null, 1s)
 timediff('2022-01-01 08:00:00', null, 1s) |
============================================
 NULL                                      |

taos> select timediff('www', 'ttt')
 timediff('www', 'ttt') |
=========================
 NULL                   |

taos> select timediff(ts, ts) from ts_4893.meters limit 1
   timediff(ts, ts)    |
========================
                     0 |

taos> select timediff(ts, ts - 1d) from ts_4893.meters limit 1
 timediff(ts, ts - 1d) |
========================
              86400000 |

taos> select timediff(ts, '00:00:00') from ts_4893.meters limit 1
 timediff(ts, '00:00:00') |
===========================
 NULL                     |

taos> select timediff(ts, null) from ts_4893.meters limit 1
  timediff(ts, null)   |
========================
 NULL                  |

taos> select timediff('25:61:61', ts) from ts_4893.meters limit 1
 timediff('25:61:61', ts) |
===========================
 NULL                     |

taos> select timediff('invalid_format', ts) from ts_4893.meters limit 1
 timediff('invalid_format', ts) |
=================================
 NULL                           |

taos> select timediff(name, ts) from ts_4893.meters limit 2
  timediff(name, ts)   |
========================
 NULL                  |
 NULL                  |

taos> select timediff('string_value', 'another_string') from ts_4893.meters limit 1
 timediff('string_value', 'another_string') |
=============================================
 NULL                                       |

