
taos> select avg(1)
          avg(1)           |
============================
                         1 |

taos> select avg(cast(1 as tinyint))
  avg(cast(1 as tinyint))  |
============================
                         1 |

taos> select avg(cast(100 as smallint))
 avg(cast(100 as smallint)) |
=============================
                        100 |

taos> select avg(cast(100000 as int))
 avg(cast(100000 as int))  |
============================
                    100000 |

taos> select avg(cast(10000000000 as bigint))
 avg(cast(10000000000 as bigint)) |
===================================
                      10000000000 |

taos> select avg(cast(1 as tinyint unsigned))
 avg(cast(1 as tinyint unsigned)) |
===================================
                                1 |

taos> select avg(cast(100 as smallint unsigned))
 avg(cast(100 as smallint unsigned)) |
======================================
                                 100 |

taos> select avg(cast(100000 as int unsigned))
 avg(cast(100000 as int unsigned)) |
====================================
                            100000 |

taos> select avg(cast(10000000000 as bigint unsigned))
 avg(cast(10000000000 as bigint unsigned)) |
============================================
                               10000000000 |

taos> select avg(cast(1.1 as float))
  avg(cast(1.1 as float))  |
============================
          1.10000002384186 |

taos> select avg(cast(1.1 as double)
