
taos> select DEGREES(0)
        degrees(0)         |
============================
                         0 |

taos> select DEGREES(1)
        degrees(1)         |
============================
          57.2957795130823 |

taos> select DEGREES(1.5)
       degrees(1.5)        |
============================
          85.9436692696235 |

taos> select DEGREES(100)
       degrees(100)        |
============================
          5729.57795130823 |

taos> select DEGREES(-1)
        degrees(-1)        |
============================
         -57.2957795130823 |

taos> select DEGREES(-1.5)
       degrees(-1.5)       |
============================
         -85.9436692696235 |

taos> select DEGREES(-100)
       degrees(-100)       |
============================
         -5729.57795130823 |

taos> select DEGREES(1) + 1
      degrees(1) + 1       |
============================
          58.2957795130823 |

taos> select DEGREES(1) - 1
      degrees(1) - 1       |
============================
          56.2957795130823 |

taos> select DEGREES(1) * 1
      degrees(1) * 1       |
============================
          57.2957795130823 |

taos> select DEGREES(1) / 1
      degrees(1) / 1       |
============================
          57.2957795130823 |

taos> select DEGREES(1) from ts_4893.meters limit 5
        degrees(1)         |
============================
          57.2957795130823 |
          57.2957795130823 |
          57.2957795130823 |
          57.2957795130823 |
          57.2957795130823 |

taos> select DEGREES(1) + 1 from ts_4893.meters limit 1
      degrees(1) + 1       |
============================
          58.2957795130823 |

taos> select DEGREES(1) - 1 from ts_4893.meters limit 1
      degrees(1) - 1       |
============================
          56.2957795130823 |

taos> select DEGREES(1) * 2 from ts_4893.meters limit 1
      degrees(1) * 2       |
============================
          114.591559026165 |

taos> select DEGREES(1) / 2 from ts_4893.meters limit 1
      degrees(1) / 2       |
============================
          28.6478897565412 |

taos> select DEGREES(2) + DEGREES(1) from ts_4893.meters limit 1
  degrees(2) + degrees(1)  |
============================
          171.887338539247 |

taos> select DEGREES(2) - DEGREES(1) from ts_4893.meters limit 1
  degrees(2) - degrees(1)  |
============================
          57.2957795130823 |

taos> select DEGREES(2) * DEGREES(1) from ts_4893.meters limit 1
  degrees(2) * degrees(1)  |
============================
          6565.61270002349 |

taos> select DEGREES(2) / DEGREES(1) from ts_4893.meters limit 1
  degrees(2) / degrees(1)  |
============================
                         2 |

taos> select DEGREES(1) + id from ts_4893.meters order by ts limit 5
      degrees(1) + id      |
============================
          57.2957795130823 |
          58.2957795130823 |
          59.2957795130823 |
          60.2957795130823 |
          61.2957795130823 |

taos> select DEGREES(id) + id from ts_4893.meters order by ts limit 5
     degrees(id) + id      |
============================
                         0 |
          58.2957795130823 |
          116.591559026165 |
          174.887338539247 |
          233.183118052329 |

taos> select DEGREES(abs(10))
     degrees(abs(10))      |
============================
          572.957795130823 |

taos> select DEGREES(PI())
       degrees(pi())       |
============================
                       180 |

taos> select abs(DEGREES(10))
     abs(degrees(10))      |
============================
          572.957795130823 |

taos> select pow(DEGREES(10), 2)
    pow(degrees(10), 2)    |
============================
          328280.635001174 |

taos> select sqrt(DEGREES(10))
     sqrt(degrees(10))     |
============================
           23.936536824086 |

taos> select cast(DEGREES(10) as int)
 cast(degrees(10) as int) |
===========================
                      572 |

taos> select DEGREES(sqrt(id)) from ts_4893.meters order by ts limit 5
     degrees(sqrt(id))     |
============================
                         0 |
          57.2957795130823 |
          81.0284684541396 |
          99.2392011759226 |
          114.591559026165 |

taos> select degrees(pi())
       degrees(pi())       |
============================
                       180 |

taos> select degrees(current) from ts_4893.d0 order by ts limit 10
     degrees(current)      |
============================
          610.200029957721 |
          491.254034090377 |
          561.212164701962 |
          643.603479905019 |
           613.40863426374 |
          487.472513516778 |
           549.81028403365 |
          628.076328902559 |
          643.202411196956 |
          592.266466706883 |

taos> select degrees(current) from ts_4893.meters order by ts limit 10
     degrees(current)      |
============================
          610.200029957721 |
          491.254034090377 |
          561.212164701962 |
          643.603479905019 |
           613.40863426374 |
          487.472513516778 |
           549.81028403365 |
          628.076328902559 |
          643.202411196956 |
          592.266466706883 |

taos> select degrees(null)
       degrees(null)       |
============================
 NULL                      |

taos> select degrees(-5)
        degrees(-5)        |
============================
         -286.478897565412 |

taos> select degrees(3.14)
       degrees(3.14)       |
============================
          179.908747671079 |

taos> select degrees(2*pi())
      degrees(2*pi())      |
============================
                       360 |

taos> select degrees(pi()/2)
      degrees(pi()/2)      |
============================
                        90 |

taos> select degrees(-pi()/2)
     degrees(-pi()/2)      |
============================
                       -90 |

taos> select degrees(1000000)
     degrees(1000000)      |
============================
          57295779.5130823 |

taos> select degrees(sin(1))
      degrees(sin(1))      |
============================
          48.2127360122095 |

taos> select degrees(cos(1))
      degrees(cos(1))      |
============================
          30.9570417874309 |

taos> select degrees(tan(1))
      degrees(tan(1))      |
============================
          89.2328896037985 |

taos> select degrees(radians(90))
   degrees(radians(90))    |
============================
                        90 |

taos> select degrees(atan(1))
     degrees(atan(1))      |
============================
                        45 |

taos> select degrees(phase) from ts_4893.meters limit 1
      degrees(phase)       |
============================
          29.1577087365693 |

taos> select degrees(current) from ts_4893.meters limit 1
     degrees(current)      |
============================
          610.200029957721 |

taos> select degrees(voltage) from ts_4893.meters limit 1
     degrees(voltage)      |
============================
          12662.3672723912 |

