
taos> select LN(100)
          ln(100)          |
============================
          4.60517018598809 |

taos> select LN(1.5)
          ln(1.5)          |
============================
         0.405465108108164 |

taos> select LN(100)
          ln(100)          |
============================
          4.60517018598809 |

taos> select LN(100) + 1
        ln(100) + 1        |
============================
          5.60517018598809 |

taos> select LN(100) - 1
        ln(100) - 1        |
============================
          3.60517018598809 |

taos> select LN(100) * 1
        ln(100) * 1        |
============================
          4.60517018598809 |

taos> select LN(100) / 1
        ln(100) / 1        |
============================
          4.60517018598809 |

taos> select LN(100) from ts_4893.meters limit 5
          ln(100)          |
============================
          4.60517018598809 |
          4.60517018598809 |
          4.60517018598809 |
          4.60517018598809 |
          4.60517018598809 |

taos> select LN(100) + 1 from ts_4893.meters limit 1
        ln(100) + 1        |
============================
          5.60517018598809 |

taos> select LN(100) - 1 from ts_4893.meters limit 1
        ln(100) - 1        |
============================
          3.60517018598809 |

taos> select LN(100) * 2 from ts_4893.meters limit 1
        ln(100) * 2        |
============================
          9.21034037197618 |

taos> select LN(100) / 2 from ts_4893.meters limit 1
        ln(100) / 2        |
============================
          2.30258509299405 |

taos> select LN(2) + LN(100) from ts_4893.meters limit 1
      ln(2) + ln(100)      |
============================
          5.29831736654804 |

taos> select LN(2) - LN(100) from ts_4893.meters limit 1
      ln(2) - ln(100)      |
============================
         -3.91202300542815 |

taos> select LN(2) * LN(100) from ts_4893.meters limit 1
      ln(2) * ln(100)      |
============================
          3.19206073041636 |

taos> select LN(2) / LN(100) from ts_4893.meters limit 1
      ln(2) / ln(100)      |
============================
         0.150514997831991 |

taos> select LN(100) + id from ts_4893.meters order by ts limit 5
       ln(100) + id        |
============================
          4.60517018598809 |
          5.60517018598809 |
          6.60517018598809 |
          7.60517018598809 |
          8.60517018598809 |

taos> select LN(id + 1) + id from ts_4893.meters order by ts limit 5
      ln(id + 1) + id      |
============================
                         0 |
          1.69314718055995 |
          3.09861228866811 |
          4.38629436111989 |
           5.6094379124341 |

taos> select ln(null)
         ln(null)          |
============================
 NULL                      |

taos> select ln(0)
           ln(0)           |
============================
 NULL                      |

taos> select ln(-5)
          ln(-5)           |
============================
 NULL                      |

taos> select abs(LN(10))
        abs(ln(10))        |
============================
          2.30258509299405 |

taos> select pow(LN(10), 2)
      pow(ln(10), 2)       |
============================
           5.3018981104784 |

taos> select sqrt(LN(10))
       sqrt(ln(10))        |
============================
          1.51742712938515 |

taos> select cast(LN(10) as int)
 cast(ln(10) as int) |
======================
                   2 |

taos> select LN(sqrt(id) + 1) from ts_4893.meters order by ts limit 5
     ln(sqrt(id) + 1)      |
============================
                         0 |
         0.693147180559945 |
         0.881373587019543 |
          1.00505253874238 |
          1.09861228866811 |

taos> select LN(LN(LN(LN(10000))))
   ln(ln(ln(ln(10000))))   |
============================
        -0.226079864157595 |

taos> select LN(EXP(2))
        ln(exp(2))         |
============================
                         2 |

taos> select ln(10)
          ln(10)           |
============================
          2.30258509299405 |

taos> select ln(pi())
         ln(pi())          |
============================
           1.1447298858494 |

taos> select ln(current) from ts_4893.d0 order by ts limit 10
        ln(current)        |
============================
          2.36555985633668 |
          2.14873440999775 |
          2.28187205918557 |
          2.41885585700037 |
          2.37080436261419 |
          2.14100694127785 |
          2.26134631556023 |
          2.39443473688013 |
          2.41823250156841 |
          2.33572968125342 |

taos> select ln(current) from ts_4893.meters order by ts limit 10
        ln(current)        |
============================
          2.36555985633668 |
          2.14873440999775 |
          2.28187205918557 |
          2.41885585700037 |
          2.37080436261419 |
          2.14100694127785 |
          2.26134631556023 |
          2.39443473688013 |
          2.41823250156841 |
          2.33572968125342 |

taos> select ln(1)
           ln(1)           |
============================
                         0 |

taos> select ln(20)
          ln(20)           |
============================
          2.99573227355399 |

taos> select ln(100)
          ln(100)          |
============================
          4.60517018598809 |

taos> select ln(99999999999999)
    ln(99999999999999)     |
============================
          32.2361913019166 |

taos> select ln(0.1)
          ln(0.1)          |
============================
         -2.30258509299405 |

taos> select ln(2.718)
         ln(2.718)         |
============================
         0.999896315728952 |

taos> select ln(exp(1))
        ln(exp(1))         |
============================
                         1 |

taos> select ln(voltage) from ts_4893.meters where voltage > 0 limit 1
        ln(voltage)        |
============================
          5.39816270151775 |

taos> select ln(current) from ts_4893.meters where current > 0 limit 1
        ln(current)        |
============================
          2.36555985633668 |

taos> select ln(phase) from ts_4893.meters where phase > 0 limit 1
         ln(phase)         |
============================
        -0.675507636551043 |

taos> select ln(exp(voltage)) from ts_4893.meters where voltage > 0 limit 1
     ln(exp(voltage))      |
============================
                       221 |

taos> select ln(abs(current)) from ts_4893.meters where current != 0 limit 1
     ln(abs(current))      |
============================
          2.36555985633668 |

taos> select ln(sqrt(phase)) from ts_4893.meters where phase >= 0 limit 1
      ln(sqrt(phase))      |
============================
        -0.337753818275521 |

taos> select ln(log(current)) from ts_4893.meters where current > 1 limit 1
     ln(log(current))      |
============================
         0.861014719652538 |

