
taos> select replace('aaaa','a','b')
 replace('aaaa','a','b') |
==========================
 bbbb                    |

taos> select replace('aaaa','aa','b')
 replace('aaaa','aa','b') |
===========================
 bb                       |

taos> select replace('aaaa','a','bb')
 replace('aaaa','a','bb') |
===========================
 bbbbbbbb                 |

taos> select replace('aaaa','','b')
 replace('aaaa','','b') |
=========================
 aaaa                   |

taos> select replace('bbbb','a','c')
 replace('bbbb','a','c') |
==========================
 bbbb                    |

taos> select replace(concat(lower(concat('THIS',' ','IS',' ','A',' ')),upper('false'),' ','test'),'FALSE','REAL') 
 replace(concat(lower(concat('THIS',' ','IS',' ','A',' ')),upper( |
===================================================================
 this is a REAL test                                              |

taos> select replace('北京涛思','北京', '')
 replace('北京涛思','北京', '') |
=======================================
 涛思                                 |

taos> select replace('北京涛思','涛思', '')
 replace('北京涛思','涛思', '') |
=======================================
 北京                                 |

taos> select replace('北京涛思.com','思.', '北京')
 replace('北京涛思.com','思.', '北京') |
===============================================
 北京涛北京com                                |

taos> select replace('北京涛思.com','北com', '北京涛')
 replace('北京涛思.com','北com', '北京涛') |
====================================================
 北京涛思.com                                      |

taos> select replace('北京涛思', char(ascii('北')), 'wrongans')
 replace('北京涛思', char(ascii('北')), 'wrongans') |
==========================================================
 北京涛思                                                |

taos> select replace(nch1, 'a', 'b') from ts_4893.meters order by ts limit 5
    replace(nch1, 'a', 'b')     |
=================================
 novel                          |
 一二三四五六七八九十           |
 updbte                         |
 prision                        |
 novel                          |

taos> select replace(nch1, 'a', 'b') from ts_4893.meters where position('a' IN nch1) != 0 order by ts limit 5
    replace(nch1, 'a', 'b')     |
=================================
 updbte                         |
 bgbin                          |
 bgbin                          |
 plbte                          |
 bbc一二三bbc一二三bbc          |

taos> select replace(nch1, 'a', 'b') from ts_4893.meters where position('a' IN nch1) = 0 order by ts limit 5
    replace(nch1, 'a', 'b')     |
=================================
 novel                          |
 一二三四五六七八九十           |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, 'a', '啊') from ts_4893.meters order by ts limit 5
   replace(nch1, 'a', '啊')    |
=================================
 novel                          |
 一二三四五六七八九十           |
 upd啊te                        |
 prision                        |
 novel                          |

taos> select replace(nch1, 'a', '啊') from ts_4893.meters where position('a' IN nch1) != 0 order by ts limit 5
   replace(nch1, 'a', '啊')    |
=================================
 upd啊te                        |
 啊g啊in                        |
 啊g啊in                        |
 pl啊te                         |
 啊bc一二三啊bc一二三啊bc       |

taos> select replace(nch1, 'a', '啊') from ts_4893.meters where position('a' IN nch1) = 0 order by ts limit 5
   replace(nch1, 'a', '啊')    |
=================================
 novel                          |
 一二三四五六七八九十           |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, '一', '壹') from ts_4893.meters order by ts limit 5
  replace(nch1, '一', '壹')   |
=================================
 novel                          |
 壹二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, '一', '壹') from ts_4893.meters where position('一' IN nch1) != 0 order by ts limit 5
  replace(nch1, '一', '壹')   |
=================================
 壹二三四五六七八九十           |
 壹二三四五六七八九十           |
 abc壹二三abc壹二三abc          |
 壹壹壹壹壹||壹壹壹壹           |
 壹二三123321三二壹             |

taos> select replace(nch1, '一', '壹') from ts_4893.meters where position('一' IN nch1) = 0 order by ts limit 5
  replace(nch1, '一', '壹')   |
=================================
 novel                          |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, '一', '1') from ts_4893.meters order by ts limit 5
   replace(nch1, '一', '1')    |
=================================
 novel                          |
 1二三四五六七八九十            |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, '一', '1') from ts_4893.meters where position('一' IN nch1) != 0 order by ts limit 5
   replace(nch1, '一', '1')    |
=================================
 1二三四五六七八九十            |
 1二三四五六七八九十            |
 abc1二三abc1二三abc            |
 11111||1111                    |
 1二三123321三二1               |

taos> select replace(nch1, '一', '1') from ts_4893.meters where position('一' IN nch1) = 0 order by ts limit 5
   replace(nch1, '一', '1')    |
=================================
 novel                          |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, nch2, 'nch2') from ts_4893.meters order by ts limit 5
  replace(nch1, nch2, 'nch2')   |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novnch2l                       |

taos> select replace(nch1, nch2, 'nch2') from ts_4893.meters where position(nch2 IN nch1) != 0 order by ts limit 5
  replace(nch1, nch2, 'nch2')   |
=================================
 novnch2l                       |
 anch2c一二三anch2c一二三anch2c |
 一二三anch2c                   |
 一二三nch2五六七八九十         |
 pnch2rson                      |

taos> select replace(nch1, nch2, 'nch2') from ts_4893.meters where position(nch2 IN nch1) = 0 order by ts limit 5
  replace(nch1, nch2, 'nch2')   |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, var2, 'var2') from ts_4893.meters order by ts limit 5
  replace(nch1, var2, 'var2')   |
=================================
 novvar2l                       |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, var2, 'var2') from ts_4893.meters where position(var2 IN nch1) != 0 order by ts limit 5
  replace(nch1, var2, 'var2')   |
=================================
 novvar2l                       |
 novvar2l                       |
 var2abc                        |
 var2123321三二一               |
 abvar2一二三abvar2一二三abvar2 |

taos> select replace(nch1, var2, 'var2') from ts_4893.meters where position(var2 IN nch1) = 0 order by ts limit 5
  replace(nch1, var2, 'var2')   |
=================================
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, '三', nch2) from ts_4893.meters order by ts limit 5
   replace(nch1, '三', nch2)   |
=================================
 novel                          |
 一二f四五六七八九十            |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, '三', nch2) from ts_4893.meters where position('三' IN nch1) != 0 order by ts limit 5
   replace(nch1, '三', nch2)   |
=================================
 一二f四五六七八九十            |
 一二d四五六七八九十            |
 abc一二babc一二babc            |
 一二三a123321三a二一           |
 一二babc                       |

taos> select replace(nch1, '三', nch2) from ts_4893.meters where position('三' IN nch1) = 0 order by ts limit 5
   replace(nch1, '三', nch2)   |
=================================
 novel                          |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, '三', var2) from ts_4893.meters order by ts limit 5
   replace(nch1, '三', var2)   |
=================================
 novel                          |
 一二三a四五六七八九十          |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, '三', var2) from ts_4893.meters where position('三' IN nch1) != 0 order by ts limit 5
   replace(nch1, '三', var2)   |
=================================
 一二三a四五六七八九十          |
 一二b四五六七八九十            |
 abc一二fabc一二fabc            |
 一二三a123321三a二一           |
 一二一二三abc                  |

taos> select replace(nch1, '三', var2) from ts_4893.meters where position('三' IN nch1) = 0 order by ts limit 5
   replace(nch1, '三', var2)   |
=================================
 novel                          |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(nch1, nch2, var2) from ts_4893.meters order by ts limit 5
   replace(nch1, nch2, var2)    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novbl                          |

taos> select replace(nch1, nch2, var2) from ts_4893.meters where position(nch2 IN nch1) != 0 order by ts limit 5
   replace(nch1, nch2, var2)    |
=================================
 novbl                          |
 afc一二三afc一二三afc          |
 一二三a一二三c                 |
 一二三三a五六七八九十          |
 pdrson                         |

taos> select replace(nch1, nch2, var2) from ts_4893.meters where position(nch2 IN nch1) = 0 order by ts limit 5
   replace(nch1, nch2, var2)    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, var2, nch2) from ts_4893.meters order by ts limit 5
   replace(nch1, var2, nch2)    |
=================================
 nov四l                         |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |

taos> select replace(nch1, var2, nch2) from ts_4893.meters where position(var2 IN nch1) != 0 order by ts limit 5
   replace(nch1, var2, nch2)    |
=================================
 nov四l                         |
 novcl                          |
 babc                           |
 三a123321三二一                |
 abf一二三abf一二三abf          |

taos> select replace(nch1, var2, nch2) from ts_4893.meters where position(var2 IN nch1) = 0 order by ts limit 5
   replace(nch1, var2, nch2)    |
=================================
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |

taos> select replace(var1, 'a', 'b') from ts_4893.meters order by ts limit 5
    replace(var1, 'a', 'b')     |
=================================
 novel                          |
 person                         |
 novel                          |
 plbte                          |
 一二三四五六七八九十           |

taos> select replace(var1, 'a', 'b') from ts_4893.meters where position('a' IN var1) != 0 order by ts limit 5
    replace(var1, 'a', 'b')     |
=================================
 plbte                          |
 updbte                         |
 plbte                          |
 updbte                         |
 一二三bbc                      |

taos> select replace(var1, 'a', 'b') from ts_4893.meters where position('a' IN var1) = 0 order by ts limit 5
    replace(var1, 'a', 'b')     |
=================================
 novel                          |
 person                         |
 novel                          |
 一二三四五六七八九十           |
 prision                        |

taos> select replace(var1, 'a', '啊') from ts_4893.meters order by ts limit 5
   replace(var1, 'a', '啊')    |
=================================
 novel                          |
 person                         |
 novel                          |
 pl啊te                         |
 一二三四五六七八九十           |

taos> select replace(var1, 'a', '啊') from ts_4893.meters where position('a' IN var1) != 0 order by ts limit 5
   replace(var1, 'a', '啊')    |
=================================
 pl啊te                         |
 upd啊te                        |
 pl啊te                         |
 upd啊te                        |
 一二三啊bc                     |

taos> select replace(var1, 'a', '啊') from ts_4893.meters where position('a' IN var1) = 0 order by ts limit 5
   replace(var1, 'a', '啊')    |
=================================
 novel                          |
 person                         |
 novel                          |
 一二三四五六七八九十           |
 prision                        |

taos> select replace(var1, '一', '壹') from ts_4893.meters order by ts limit 5
  replace(var1, '一', '壹')   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 壹二三四五六七八九十           |

taos> select replace(var1, '一', '壹') from ts_4893.meters where position('一' IN var1) != 0 order by ts limit 5
  replace(var1, '一', '壹')   |
=================================
 壹二三四五六七八九十           |
 壹二三abc                      |
 abc壹二三abc壹二三abc          |
 壹二三123321三二壹             |
 壹壹壹壹壹||壹壹壹壹           |

taos> select replace(var1, '一', '壹') from ts_4893.meters where position('一' IN var1) = 0 order by ts limit 5
  replace(var1, '一', '壹')   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 update                         |

taos> select replace(var1, '一', '1') from ts_4893.meters order by ts limit 5
   replace(var1, '一', '1')    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 1二三四五六七八九十            |

taos> select replace(var1, '一', '1') from ts_4893.meters where position('一' IN var1) != 0 order by ts limit 5
   replace(var1, '一', '1')    |
=================================
 1二三四五六七八九十            |
 1二三abc                       |
 abc1二三abc1二三abc            |
 1二三123321三二1               |
 11111||1111                    |

taos> select replace(var1, '一', '1') from ts_4893.meters where position('一' IN var1) = 0 order by ts limit 5
   replace(var1, '一', '1')    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 update                         |

taos> select replace(var1, nch2, 'nch2') from ts_4893.meters order by ts limit 5
  replace(var1, nch2, 'nch2')   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |

taos> select replace(var1, nch2, 'nch2') from ts_4893.meters where position(nch2 IN var1) != 0 order by ts limit 5
  replace(var1, nch2, 'nch2')   |
=================================
 一二nch2bc                     |
 anch2c一二三anch2c一二三anch2c |
 nch2bc一二三nch2bc一二三nch2bc |
 novnch2l                       |
 upnch2ate                      |

taos> select replace(var1, nch2, 'nch2') from ts_4893.meters where position(nch2 IN var1) = 0 order by ts limit 5
  replace(var1, nch2, 'nch2')   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |

taos> select replace(var1, var2, 'var2') from ts_4893.meters order by ts limit 5
  replace(var1, var2, 'var2')   |
=================================
 novvar2l                       |
 person                         |
 novel                          |
 platvar2                       |
 一二三四五六七八九十           |

taos> select replace(var1, var2, 'var2') from ts_4893.meters where position(var2 IN var1) != 0 order by ts limit 5
  replace(var1, var2, 'var2')   |
=================================
 novvar2l                       |
 platvar2                       |
 一二三var2bc                   |
 var2123321三二一               |
 abvar2一二三abvar2一二三abvar2 |

taos> select replace(var1, var2, 'var2') from ts_4893.meters where position(var2 IN var1) = 0 order by ts limit 5
  replace(var1, var2, 'var2')   |
=================================
 person                         |
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |

taos> select replace(var1, '三', nch2) from ts_4893.meters order by ts limit 5
   replace(var1, '三', nch2)   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二e四五六七八九十            |

taos> select replace(var1, '三', nch2) from ts_4893.meters where position('三' IN var1) != 0 order by ts limit 5
   replace(var1, '三', nch2)   |
=================================
 一二e四五六七八九十            |
 一二三aabc                     |
 abc一二babc一二babc            |
 一二三a123321三a二一           |
 一二c四五六七八九十            |

taos> select replace(var1, '三', nch2) from ts_4893.meters where position('三' IN var1) = 0 order by ts limit 5
   replace(var1, '三', nch2)   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 update                         |

taos> select replace(var1, '三', var2) from ts_4893.meters order by ts limit 5
   replace(var1, '三', var2)   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二b四五六七八九十            |

taos> select replace(var1, '三', var2) from ts_4893.meters where position('三' IN var1) != 0 order by ts limit 5
   replace(var1, '三', var2)   |
=================================
 一二b四五六七八九十            |
 一二aabc                       |
 abc一二fabc一二fabc            |
 一二四123321四二一             |
 一二b四五六七八九十            |

taos> select replace(var1, '三', var2) from ts_4893.meters where position('三' IN var1) = 0 order by ts limit 5
   replace(var1, '三', var2)   |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 update                         |

taos> select replace(var1, nch2, var2) from ts_4893.meters order by ts limit 5
   replace(var1, nch2, var2)    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |

taos> select replace(var1, nch2, var2) from ts_4893.meters where position(nch2 IN var1) != 0 order by ts limit 5
   replace(var1, nch2, var2)    |
=================================
 一二abc                        |
 afc一二三afc一二三afc          |
 四bc一二三四bc一二三四bc       |
 novdl                          |
 up一二三ate                    |

taos> select replace(var1, nch2, var2) from ts_4893.meters where position(nch2 IN var1) = 0 order by ts limit 5
   replace(var1, nch2, var2)    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |

taos> select replace(var1, var2, nch2) from ts_4893.meters order by ts limit 5
   replace(var1, var2, nch2)    |
=================================
 nov四l                         |
 person                         |
 novel                          |
 plat一                         |
 一二三四五六七八九十           |

taos> select replace(var1, var2, nch2) from ts_4893.meters where position(var2 IN var1) != 0 order by ts limit 5
   replace(var1, var2, nch2)    |
=================================
 nov四l                         |
 plat一                         |
 一二三三abc                    |
 b123321三二一                  |
 abf一二三abf一二三abf          |

taos> select replace(var1, var2, nch2) from ts_4893.meters where position(var2 IN var1) = 0 order by ts limit 5
   replace(var1, var2, nch2)    |
=================================
 person                         |
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2') from ts_4893.meters order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2 |
===================================================================
 一二三nch2五六七abcdefghijk213124123                             |
 一二三四五六七abcdench2ghijk213124123                            |
 一二三四五六七abnch2defghijk213124123                            |
 nch2二三四五六七abcdefghijk213124123                             |
 一二三四五六七abcdnch2fghijk213124123                            |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2') from ts_4893.meters where position(nch2 IN '一二三四五六七abcdefghijk213124123') != 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2 |
===================================================================
 一二三nch2五六七abcdefghijk213124123                             |
 一二三四五六七abcdench2ghijk213124123                            |
 一二三四五六七abnch2defghijk213124123                            |
 nch2二三四五六七abcdefghijk213124123                             |
 一二三四五六七abcdnch2fghijk213124123                            |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2') from ts_4893.meters where position(nch2 IN '一二三四五六七abcdefghijk213124123') = 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, 'nch2 |
===================================================================
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, var2) from ts_4893.meters order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, var2) |
===================================================================
 一二三e五六七abcdefghijk213124123                                |
 一二三四五六七abcde三aghijk213124123                             |
 一二三四五六七ab四defghijk213124123                              |
 e二三四五六七abcdefghijk213124123                                |
 一二三四五六七abcdbfghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, var2) from ts_4893.meters where position(nch2 IN '一二三四五六七abcdefghijk213124123') != 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, var2) |
===================================================================
 一二三e五六七abcdefghijk213124123                                |
 一二三四五六七abcde三aghijk213124123                             |
 一二三四五六七ab四defghijk213124123                              |
 e二三四五六七abcdefghijk213124123                                |
 一二三四五六七abcdbfghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', nch2, var2) from ts_4893.meters where position(nch2 IN '一二三四五六七abcdefghijk213124123') = 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', nch2, var2) |
===================================================================
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, 'var2') from ts_4893.meters order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, 'var2 |
===================================================================
 一二三四五六七abcdvar2fghijk213124123                            |
 一二三四五六七abcdefghijk213124123                               |
 一二三var2五六七abcdefghijk213124123                             |
 一二三四五六七abcdvar2fghijk213124123                            |
 一二三四五六七avar2cdefghijk213124123                            |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, 'var2') from ts_4893.meters where position(var2 IN '一二三四五六七abcdefghijk213124123') != 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, 'var2 |
===================================================================
 一二三四五六七abcdvar2fghijk213124123                            |
 一二三var2五六七abcdefghijk213124123                             |
 一二三四五六七abcdvar2fghijk213124123                            |
 一二三四五六七avar2cdefghijk213124123                            |
 一二三四五六七abcdefvar2hijk213124123                            |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, 'var2') from ts_4893.meters where position(var2 IN '一二三四五六七abcdefghijk213124123') = 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, 'var2 |
===================================================================
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, nch2) from ts_4893.meters order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, nch2) |
===================================================================
 一二三四五六七abcd四fghijk213124123                              |
 一二三四五六七abcdefghijk213124123                               |
 一二三c五六七abcdefghijk213124123                                |
 一二三四五六七abcd一fghijk213124123                              |
 一二三四五六七aecdefghijk213124123                               |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, nch2) from ts_4893.meters where position(var2 IN '一二三四五六七abcdefghijk213124123') != 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, nch2) |
===================================================================
 一二三四五六七abcd四fghijk213124123                              |
 一二三c五六七abcdefghijk213124123                                |
 一二三四五六七abcd一fghijk213124123                              |
 一二三四五六七aecdefghijk213124123                               |
 一二三四五六七abcdef一二三hijk213124123                          |

taos> select replace('一二三四五六七abcdefghijk213124123', var2, nch2) from ts_4893.meters where position(var2 IN '一二三四五六七abcdefghijk213124123') = 0 order by ts limit 5
 replace('一二三四五六七abcdefghijk213124123', var2, nch2) |
===================================================================
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |
 一二三四五六七abcdefghijk213124123                               |

taos> select replace('aabbccdd','aa', 'ee')
 replace('aabbccdd','aa', 'ee') |
=================================
 eebbccdd                       |

taos> select replace('aabbccdd','AA', 'ee')
 replace('aabbccdd','AA', 'ee') |
=================================
 aabbccdd                       |

taos> select replace('北京','北' , '南')
 replace('北京','北' , '南') |
==================================
 南京                            |

taos> select replace('北京','京' , '南')
 replace('北京','京' , '南') |
==================================
 北南                            |

taos> select replace('北京taos','北' , '南')
 replace('北京taos','北' , '南') |
======================================
 南京taos                            |

taos> select replace(nch1, nch2, 't') from ts_4893.d0 order by ts limit 10
    replace(nch1, nch2, 't')    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novtl                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select replace(nch1, nch2, 't') from ts_4893.meters order by ts limit 10
    replace(nch1, nch2, 't')    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novtl                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select replace(nch1, var2, 't') from ts_4893.d0 order by ts limit 10
    replace(nch1, var2, 't')    |
=================================
 novtl                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novtl                          |
 again                          |

taos> select replace(nch1, var2, 't') from ts_4893.meters order by ts limit 10
    replace(nch1, var2, 't')    |
=================================
 novtl                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novtl                          |
 again                          |

taos> select replace(var1, nch2, 't') from ts_4893.d0 order by ts limit 10
    replace(var1, nch2, 't')    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select replace(var1, nch2, 't') from ts_4893.meters order by ts limit 10
    replace(var1, nch2, 't')    |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select replace(var1, var2, 't') from ts_4893.d0 order by ts limit 10
    replace(var1, var2, 't')    |
=================================
 novtl                          |
 person                         |
 novel                          |
 platt                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select replace(var1, var2, 't') from ts_4893.meters order by ts limit 10
    replace(var1, var2, 't')    |
=================================
 novtl                          |
 person                         |
 novel                          |
 platt                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select replace(nch1, nch2, var1) from ts_4893.d0 order by ts limit 10
   replace(nch1, nch2, var1)    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 nov一二三四五六七八九十l       |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select replace(nch1, nch2, var1) from ts_4893.meters order by ts limit 10
   replace(nch1, nch2, var1)    |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 nov一二三四五六七八九十l       |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select replace(null, 'aa', 'ee')
 replace(null, 'aa', 'ee') |
============================
 NULL                      |

taos> select replace(null, 'A', 'B')
 replace(null, 'A', 'B') |
==========================
 NULL                    |

taos> select replace('', '', 'B')
 replace('', '', 'B') |
=======================
                      |

taos> select replace('', 'A', 'B')
 replace('', 'A', 'B') |
========================
                       |

taos> select replace('A', 'A', '')
 replace('A', 'A', '') |
========================
                       |

taos> select replace('aabbccdd', null, 'ee')
 replace('aabbccdd', null, 'ee') |
==================================
 NULL                            |

taos> select replace('Hello', 'Z', 'X')
 replace('Hello', 'Z', 'X') |
=============================
 Hello                      |

taos> select replace('Hello World', ' ', '_')
 replace('Hello World', ' ', '_') |
===================================
 Hello_World                      |

taos> select replace('Hello World', 'World', 'MySQL')
 replace('Hello World', 'World', 'MySQL') |
===========================================
 Hello MySQL                              |

taos> select replace('12345', '5', 'five')
 replace('12345', '5', 'five') |
================================
 1234five                      |

taos> select replace('中国', '中', '国')
 replace('中国', '中', '国') |
==================================
 国国                            |

taos> select replace('é', 'e', 'a')
 replace('é', 'e', 'a') |
==========================
 é                       |

taos> select replace('!@#', '@', '#')
 replace('!@#', '@', '#') |
===========================
 !##                      |

taos> select replace('123456', '7', 'eight')
 replace('123456', '7', 'eight') |
==================================
 123456                          |

taos> select replace(concat('A', 'B', 'C'), 'B', 'Z')
 replace(concat('A', 'B', 'C'), 'B', 'Z') |
===========================================
 AZC                                      |

taos> select replace(upper('abc'), 'A', 'X')
 replace(upper('abc'), 'A', 'X') |
==================================
 XBC                             |

taos> select replace(trim('  Hello  '), 'l', 'L')
 replace(trim('  Hello  '), 'l', 'L') |
=======================================
 HeLLo                                |

taos> select replace(lower('HELLO'), 'h', 'H')
 replace(lower('HELLO'), 'h', 'H') |
====================================
 Hello                             |

taos> select name, replace(substring(name, 1, 5), 'e', 'o') from ts_4893.meters limit 1
              name              | replace(substring(name, 1, 5), 'e', 'o') |
============================================================================
 lili                           | lili                                     |

taos> select name, replace(name, 'a', 'o') from ts_4893.meters limit 1
              name              |    replace(name, 'a', 'o')     |
==================================================================
 lili                           | lili                           |

taos> select var1, replace(var1, '1', 'one') from ts_4893.meters limit 1
              var1              |   replace(var1, '1', 'one')    |
==================================================================
 novel                          | novel                          |

taos> select nch1, replace(nch1, 'n', 'm') from ts_4893.meters limit 1
              nch1              |    replace(nch1, 'n', 'm')     |
==================================================================
 novel                          | movel                          |

