
taos> select STDDEV(current) from ts_4893.meters
      stddev(current)      |
============================
          1.15433966739033 |

taos> select STDDEV(current) from ts_4893.meters interval(1d) order by 1 limit 10
      stddev(current)      |
============================
         0.838273445081508 |
         0.838639486002895 |
         0.839707318893023 |
         0.839707318893023 |
         0.840565863329237 |
          0.84457509570056 |
         0.846680829076275 |
         0.847012514139425 |
         0.847182802733551 |
         0.848223444072482 |

taos> select STDDEV(id) from ts_4893.meters
        stddev(id)         |
============================
          2886.75133151437 |

taos> select STDDEV(id) from ts_4893.meters interval(1d) limit 10
        stddev(id)         |
============================
          4.60977222864644 |
          8.36660026534076 |
          8.36660026534076 |
          8.36660026534076 |
          8.36660026534076 |
          8.07774721070176 |
          8.36660026534076 |
          8.36660026534076 |
          8.36660026534076 |
          8.36660026534076 |

taos> select STDDEV(id) from ts_4893.meters where id > 100
        stddev(id)         |
============================
          2857.59514277302 |

taos> select STDDEV(id) from ts_4893.meters interval(1d) order by 1 limit 10
        stddev(id)         |
============================
          4.60977222864644 |
          5.47722557505166 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |
          8.07774721070176 |

taos> select stddev_pop(null) from ts_4893.meters
     stddev_pop(null)      |
============================
 NULL                      |

taos> select stddev_pop(id) from ts_4893.d0
      stddev_pop(id)       |
============================
          2886.75133151437 |

taos> select stddev_pop(id) from ts_4893.meters
      stddev_pop(id)       |
============================
          2886.75133151437 |

taos> select stddev_pop(current) from ts_4893.d0
    stddev_pop(current)    |
============================
          1.15433966739033 |

taos> select stddev_pop(current) from ts_4893.meters
    stddev_pop(current)    |
============================
          1.15433966739033 |

taos> select stddev_pop(voltage) from ts_4893.meters
    stddev_pop(voltage)    |
============================
            2.876459705958 |

taos> select stddev_pop(voltage) from ts_4893.meters where voltage is not null
    stddev_pop(voltage)    |
============================
            2.876459705958 |

taos> select stddev_pop(phase) from ts_4893.meters
     stddev_pop(phase)     |
============================
         0.288595458095627 |

taos> select stddev_pop(phase) from ts_4893.meters where ts between '2023-01-01 00:00:00' and '2023-12-31 23:59:59'
     stddev_pop(phase)     |
============================
         0.288075357963905 |

taos> select stddev_pop(total_voltage) from (select sum(voltage) as total_voltage from ts_4893.meters group by location)
 stddev_pop(total_voltage) |
============================
                         0 |

taos> select round(stddev_pop(current), 2) from ts_4893.meters
 round(stddev_pop(current), 2) |
================================
                          1.15 |

taos> select pow(stddev_pop(current), 2) from ts_4893.meters
 pow(stddev_pop(current), 2) |
==============================
            1.33250006771083 |

taos> select log(stddev_pop(voltage) + 1) from ts_4893.meters
 log(stddev_pop(voltage) + 1) |
===============================
             1.35492229018406 |

taos> select groupid, stddev_pop(voltage) from ts_4893.meters group by groupid order by groupid
 groupid |    stddev_pop(voltage)    |
======================================
       1 |            2.876459705958 |

taos> select location, stddev_pop(current) from ts_4893.meters group by location order by location
      location      |    stddev_pop(current)    |
=================================================
 beijing            |          1.15433966739033 |

taos> select location, stddev_pop(voltage) from ts_4893.meters group by location order by location
      location      |    stddev_pop(voltage)    |
=================================================
 beijing            |            2.876459705958 |

