
taos> select CRC32('hello')
 crc32('hello') |
=================
      907060870 |

taos> select CRC32('hello world')
 crc32('hello world') |
=======================
            222957957 |

taos> select CRC32('hello world!')
 crc32('hello world!') |
========================
              62177901 |

taos> select CRC32('hello,world.你好，世界。')
 crc32('hello,world.你好，世界。') |
==========================================
                              1785960545 |

taos> select CRC32('北京涛思数据科技有限公司')
 crc32('北京涛思数据科技有限公司') |
================================================
                                    1935136661 |

taos> select CRC32('hello') from ts_4893.meters limit 5
 crc32("hello") |
=================
      907060870 |
      907060870 |
      907060870 |
      907060870 |
      907060870 |

taos> select CRC32('hello') + 1 from ts_4893.meters limit 1
 crc32("hello") + 1 |
=====================
          907060871 |

taos> select CRC32('hello') + CRC32('hello') from ts_4893.meters limit 1
 crc32('hello') + crc32('hello') |
==================================
           1.814121740000000e+09 |


taos> select cast(CRC32('hello') as VARCHAR)
 cast(crc32('hello') as varchar) |
==================================
 907060870                       |


taos> select crc32('')
    crc32('')    |
==================
               0 |
