
taos> alter local 'compareAsStrInGreatest' '1';

taos> select LEAST(1,2,3,4,5,6,7,8,9,10);
 least(1,2,3,4,5,6,7,8,9,10) |
==============================
                           1 |

taos> select LEAST(1,1.1,2.23,3.4444,5.66666666,6.21241241,7.999999999999);
 least(1,1.1,2.23,3.4444,5.66666666,6.21241241,7.999999999999) |
================================================================
                                                             1 |

taos> select LEAST(1,'2',3.3,4.4,5);
  least(1,'2',3.3,4.4,5)   |
============================
 1                         |

taos> select LEAST(1,2,3,4,5,'5.1');
  least(1,2,3,4,5,'5.1')   |
============================
 1                         |

taos> select LEAST('1','2','3','4',5);
 least('1','2','3','4',5)  |
============================
 1                         |

taos> select LEAST('1','2','3','4','5');
 least('1','2','3','4','5') |
=============================
 1                          |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','一','二','三');
 least(1,2,3,4,5,6,7,'a','b','一','二','三') |
=================================================
 1                                              |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','c','1','2','1231213');
 least(1,2,3,4,5,6,7,'a','b','c','1','2','1231213') |
=====================================================
 1                                                  |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','c','1','2','1231213','1231213.123123');
 least(1,2,3,4,5,6,7,'a','b','c','1','2','1231213','1231213.12312 |
===================================================================
 1                                                                |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint), cast(3 as int), cast(4 as bigint), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)));
 least(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint),  |
===================================================================
 0                                                                |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as smallint unsigned), cast(3 as int unsigned), cast(4 as bigint unsigned), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)));
 least(cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as sm |
===================================================================
 0                                                                |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint), cast(3 as int), cast(4 as bigint), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)), cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as smallint unsigned), cast(3 as int unsigned), cast(4 as bigint unsigned), cast(5 as float), cast(6 as double));
 least(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint),  |
===================================================================
 0                                                                |

taos> select LEAST(cast(100 as tinyint), cast(101 as tinyint));
 least(cast(100 as tinyint), cast(101 as tinyint)) |
====================================================
                                               100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as smallint));
 least(cast(100 as tinyint), cast(101 as smallint)) |
=====================================================
                                                100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as int));
 least(cast(100 as tinyint), cast(101 as int)) |
================================================
                                           100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as bigint));
 least(cast(100 as tinyint), cast(101 as bigint)) |
===================================================
                                              100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as float));
 least(cast(100 as tinyint), cast(101 as float)) |
==================================================
                                             100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as double));
 least(cast(100 as tinyint), cast(101 as double)) |
===================================================
                                              100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as varchar(20)));
 least(cast(100 as tinyint), cast(101 as varchar(20))) |
========================================================
 100                                                   |

taos> select LEAST(cast(100 as tinyint), cast(101 as nchar(20)));
 least(cast(100 as tinyint), cast(101 as nchar(20))) |
======================================================
 100                                                 |

taos> select LEAST(cast(101 as tinyint), cast(100 as tinyint));
 least(cast(101 as tinyint), cast(100 as tinyint)) |
====================================================
                                               100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as smallint));
 least(cast(101 as tinyint), cast(100 as smallint)) |
=====================================================
                                                100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as int));
 least(cast(101 as tinyint), cast(100 as int)) |
================================================
                                           100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as bigint));
 least(cast(101 as tinyint), cast(100 as bigint)) |
===================================================
                                              100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as float));
 least(cast(101 as tinyint), cast(100 as float)) |
==================================================
                                             100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as double));
 least(cast(101 as tinyint), cast(100 as double)) |
===================================================
                                              100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as varchar(20)));
 least(cast(101 as tinyint), cast(100 as varchar(20))) |
========================================================
 100                                                   |

taos> select LEAST(cast(101 as tinyint), cast(100 as nchar(20)));
 least(cast(101 as tinyint), cast(100 as nchar(20))) |
======================================================
 100                                                 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as smallint));
 least(cast(1000 as smallint), cast(1001 as smallint)) |
========================================================
                                                  1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as int));
 least(cast(1000 as smallint), cast(1001 as int)) |
===================================================
                                             1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as bigint));
 least(cast(1000 as smallint), cast(1001 as bigint)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as float));
 least(cast(1000 as smallint), cast(1001 as float)) |
=====================================================
                                               1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as double));
 least(cast(1000 as smallint), cast(1001 as double)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as varchar(20)));
 least(cast(1000 as smallint), cast(1001 as varchar(20))) |
===========================================================
 1000                                                     |

taos> select LEAST(cast(1000 as smallint), cast(1001 as nchar(20)));
 least(cast(1000 as smallint), cast(1001 as nchar(20))) |
=========================================================
 1000                                                   |

taos> select LEAST(cast(1001 as smallint), cast(1000 as smallint));
 least(cast(1001 as smallint), cast(1000 as smallint)) |
========================================================
                                                  1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as int));
 least(cast(1001 as smallint), cast(1000 as int)) |
===================================================
                                             1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as bigint));
 least(cast(1001 as smallint), cast(1000 as bigint)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as float));
 least(cast(1001 as smallint), cast(1000 as float)) |
=====================================================
                                               1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as double));
 least(cast(1001 as smallint), cast(1000 as double)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as varchar(20)));
 least(cast(1001 as smallint), cast(1000 as varchar(20))) |
===========================================================
 1000                                                     |

taos> select LEAST(cast(1001 as smallint), cast(1000 as nchar(20)));
 least(cast(1001 as smallint), cast(1000 as nchar(20))) |
=========================================================
 1000                                                   |

taos> select LEAST(cast(1000000 as int), cast(1000001 as int));
 least(cast(1000000 as int), cast(1000001 as int)) |
====================================================
                                           1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as bigint));
 least(cast(1000000 as int), cast(1000001 as bigint)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as float));
 least(cast(1000000 as int), cast(1000001 as float)) |
======================================================
                                               1e+06 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as double));
 least(cast(1000000 as int), cast(1000001 as double)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as varchar(20)));
 least(cast(1000000 as int), cast(1000001 as varchar(20))) |
============================================================
 1000000                                                   |

taos> select LEAST(cast(1000000 as int), cast(1000001 as nchar(20)));
 least(cast(1000000 as int), cast(1000001 as nchar(20))) |
==========================================================
 1000000                                                 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as int));
 least(cast(1000001 as int), cast(1000000 as int)) |
====================================================
                                           1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as bigint));
 least(cast(1000001 as int), cast(1000000 as bigint)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as float));
 least(cast(1000001 as int), cast(1000000 as float)) |
======================================================
                                               1e+06 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as double));
 least(cast(1000001 as int), cast(1000000 as double)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as varchar(20)));
 least(cast(1000001 as int), cast(1000000 as varchar(20))) |
============================================================
 1000000                                                   |

taos> select LEAST(cast(1000001 as int), cast(1000000 as nchar(20)));
 least(cast(1000001 as int), cast(1000000 as nchar(20))) |
==========================================================
 1000000                                                 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as bigint));
 least(cast(1000000000 as bigint), cast(1000000001 as bigint)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as float));
 least(cast(1000000000 as bigint), cast(1000000001 as float)) |
===============================================================
                                                        1e+09 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as double));
 least(cast(1000000000 as bigint), cast(1000000001 as double)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as varchar(20)));
 least(cast(1000000000 as bigint), cast(1000000001 as varchar(20) |
===================================================================
 1000000000                                                       |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as nchar(20)));
 least(cast(1000000000 as bigint), cast(1000000001 as nchar(20))) |
===================================================================
 1000000000                                                       |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as bigint));
 least(cast(1000000001 as bigint), cast(1000000000 as bigint)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as float));
 least(cast(1000000001 as bigint), cast(1000000000 as float)) |
===============================================================
                                                        1e+09 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as double));
 least(cast(1000000001 as bigint), cast(1000000000 as double)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as varchar(20)));
 least(cast(1000000001 as bigint), cast(1000000000 as varchar(20) |
===================================================================
 1000000000                                                       |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as nchar(20)));
 least(cast(1000000001 as bigint), cast(1000000000 as nchar(20))) |
===================================================================
 1000000000                                                       |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as float));
 least(cast(100000.1111111 as float), cast(100001.1111111 as floa |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as double));
 least(cast(100000.1111111 as float), cast(100001.1111111 as doub |
===================================================================
                                                   100000.109375 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as timestamp));
 least(cast(100000.1111111 as float), cast(100001.1111111 as time |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as varchar(20)));
 least(cast(100000.1111111 as float), cast(100001.1111111 as varc |
===================================================================
 100000.109375                                                    |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as nchar(20)));
 least(cast(100000.1111111 as float), cast(100001.1111111 as ncha |
===================================================================
 100000.109375                                                    |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as float));
 least(cast(100001.1111111 as float), cast(100000.1111111 as floa |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as double));
 least(cast(100001.1111111 as float), cast(100000.1111111 as doub |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as timestamp));
 least(cast(100001.1111111 as float), cast(100000.1111111 as time |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as varchar(20)));
 least(cast(100001.1111111 as float), cast(100000.1111111 as varc |
===================================================================
 100000.1111111                                                   |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as nchar(20)));
 least(cast(100001.1111111 as float), cast(100000.1111111 as ncha |
===================================================================
 100000.1111111                                                   |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as double));
 least(cast(100000.1111111 as double), cast(100001.1111111 as dou |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as timestamp));
 least(cast(100000.1111111 as double), cast(100001.1111111 as tim |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as varchar(20)));
 least(cast(100000.1111111 as double), cast(100001.1111111 as var |
===================================================================
 100000.111111                                                    |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as nchar(20)));
 least(cast(100000.1111111 as double), cast(100001.1111111 as nch |
===================================================================
 100000.111111                                                    |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as double));
 least(cast(100001.1111111 as double), cast(100000.1111111 as dou |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as timestamp));
 least(cast(100001.1111111 as double), cast(100000.1111111 as tim |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as varchar(20)));
 least(cast(100001.1111111 as double), cast(100000.1111111 as var |
===================================================================
 100000.1111111                                                   |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as nchar(20)));
 least(cast(100001.1111111 as double), cast(100000.1111111 as nch |
===================================================================
 100000.1111111                                                   |

taos> select LEAST(cast('中文测试' as varchar(20)), cast('中文测试一' as varchar(20)));
 least(cast('中文测试' as varchar(20)), cast('中文测试一 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试' as varchar(20)), cast('中文测试一' as nchar(20)));
 least(cast('中文测试' as varchar(20)), cast('中文测试一 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试一' as varchar(20)), cast('中文测试' as varchar(20)));
 least(cast('中文测试一' as varchar(20)), cast('中文测试 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试一' as varchar(20)), cast('中文测试' as nchar(20)));
 least(cast('中文测试一' as varchar(20)), cast('中文测试 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('abc123abc' as varchar(20)), cast('abc124abc' as varchar(20)));
 least(cast('abc123abc' as varchar(20)), cast('abc124abc' as varc |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc123abc' as varchar(20)), cast('abc124abc' as nchar(20)));
 least(cast('abc123abc' as varchar(20)), cast('abc124abc' as ncha |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc124abc' as varchar(20)), cast('abc123abc' as varchar(20)));
 least(cast('abc124abc' as varchar(20)), cast('abc123abc' as varc |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc124abc' as varchar(20)), cast('abc123abc' as nchar(20)));
 least(cast('abc124abc' as varchar(20)), cast('abc123abc' as ncha |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc123abc' as nchar(20)), cast('abc124abc' as nchar(20)));
 least(cast('abc123abc' as nchar(20)), cast('abc124abc' as nchar( |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast(100 as tinyint), cast(101 as float), cast(102 as varchar(20)));
 least(cast(100 as tinyint), cast(101 as float), cast(102 as varc |
===================================================================
 100                                                              |

taos> select LEAST(cast(100 as varchar(20)), cast(101 as float), cast(102 as tinyint));
 least(cast(100 as varchar(20)), cast(101 as float), cast(102 as  |
===================================================================
 100                                                              |

taos> select LEAST('a','b','c','d','e','f','g','h','1231','15155');
 least('a','b','c','d','e','f','g','h','1231','15155') |
========================================================
 1231                                                  |

taos> select LEAST(current, voltage, phase, id, nch1, nch2, var1, var2) from ts_4893.meters order by ts limit 10;
 least(current, voltage, phase, id, nch1, nch2, var1, var2) |
=============================================================
 0                                                          |
 0.138830                                                   |
 0.796942                                                   |
 0.537330                                                   |
 0.313430                                                   |
 0.332767                                                   |
 0.846763                                                   |
 0.637813                                                   |
 0.115989                                                   |
 0.373575                                                   |

taos> select LEAST(current, voltage, phase, id) from ts_4893.meters order by ts limit 10;
 least(current, voltage, phase, id) |
=====================================
                                  0 |
                            0.13883 |
                           0.796942 |
                            0.53733 |
                            0.31343 |
                           0.332767 |
                           0.846763 |
                           0.637813 |
                           0.115989 |
                           0.373575 |

taos> select LEAST(nch1, nch2, var1, var2) from ts_4893.meters order by ts limit 10;
 least(nch1, nch2, var1, var2)  |
=================================
 e                              |
 f                              |
 c                              |
 e                              |
 b                              |
 g                              |
 again                          |
 b                              |
 c                              |
 again                          |

taos> select LEAST(221, voltage) from ts_4893.meters order by ts limit 10;
  least(221, voltage)  |
========================
                   221 |
                   220 |
                   215 |
                   216 |
                   219 |
                   221 |
                   215 |
                   217 |
                   216 |
                   221 |

taos> select LEAST(5, id) from ts_4893.meters order by ts limit 10;
     least(5, id)      |
========================
                     0 |
                     1 |
                     2 |
                     3 |
                     4 |
                     5 |
                     5 |
                     5 |
                     5 |
                     5 |

taos> select LEAST('r', nch1) from ts_4893.meters order by ts limit 10;
        least('r', nch1)        |
=================================
 novel                          |
 r                              |
 r                              |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 r                              |
 novel                          |
 again                          |

taos> select LEAST('r', nch1, nch2) from ts_4893.meters order by ts limit 10;
     least('r', nch1, nch2)     |
=================================
 novel                          |
 f                              |
 c                              |
 prision                        |
 e                              |
 novel                          |
 again                          |
 d                              |
 c                              |
 again                          |

taos> select LEAST('r', var1) from ts_4893.meters order by ts limit 10;
        least('r', var1)        |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 r                              |
 r                              |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select LEAST('r', var1, var2) from ts_4893.meters order by ts limit 10;
     least('r', var1, var2)     |
=================================
 e                              |
 person                         |
 novel                          |
 e                              |
 b                              |
 g                              |
 b                              |
 b                              |
 e                              |
 plate                          |

taos> select LEAST('二中文测试', nch1) from ts_4893.meters order by ts limit 10;
 least('二中文测试', nch1) |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select LEAST('二中文测试', nch1, nch2) from ts_4893.meters order by ts limit 10;
 least('二中文测试', nch1, nch2) |
=======================================
 novel                                |
 f                                    |
 c                                    |
 prision                              |
 e                                    |
 novel                                |
 again                                |
 d                                    |
 c                                    |
 again                                |

taos> select LEAST('二中文测试', var1) from ts_4893.meters order by ts limit 10;
 least('二中文测试', var1) |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select LEAST('二中文测试', var1, var2) from ts_4893.meters order by ts limit 10;
 least('二中文测试', var1, var2) |
=======================================
 e                                    |
 person                               |
 novel                                |
 e                                    |
 b                                    |
 g                                    |
 b                                    |
 b                                    |
 e                                    |
 plate                                |

taos> select LEAST('23', 3443434343434343);
 least('23', 3443434343434343) |
================================
 23                            |

taos> select LEAST(co, 3443434343434343) from ts_4893.n1;
  least(co, 3443434343434343)   |
=================================
 23                             |
 23                             |
 23                             |

taos> select LEAST('23', 3443434343434343) from ts_4893.n1;
 least('23', 3443434343434343) |
================================
 23                            |
 23                            |
 23                            |

taos> select LEAST('23', 1443434343434343) from ts_4893.n1;
 least('23', 1443434343434343) |
================================
 1443434343434343              |
 1443434343434343              |
 1443434343434343              |

taos> select LEAST(current, voltage) from ts_4893.n1;
 least(current, voltage) |
==========================
 NULL                    |
 NULL                    |
                       3 |

taos> select LEAST(current, voltage, '15') from ts_4893.n1; 
 least(current, voltage, '15') |
================================
 NULL                          |
 NULL                          |
 15                            |

taos> alter local 'compareAsStrInGreatest' '0';

taos> select LEAST(1,2,3,4,5,6,7,8,9,10);
 least(1,2,3,4,5,6,7,8,9,10) |
==============================
                           1 |

taos> select LEAST(1,1.1,2.23,3.4444,5.66666666,6.21241241,7.999999999999);
 least(1,1.1,2.23,3.4444,5.66666666,6.21241241,7.999999999999) |
================================================================
                                                             1 |

taos> select LEAST(1,'2',3.3,4.4,5);
  least(1,'2',3.3,4.4,5)   |
============================
                         1 |

taos> select LEAST(1,2,3,4,5,'5.1');
 least(1,2,3,4,5,'5.1') |
=========================
                      1 |

taos> select LEAST('1','2','3','4',5);
 least('1','2','3','4',5) |
===========================
                        1 |

taos> select LEAST('1','2','3','4','5');
 least('1','2','3','4','5') |
=============================
 1                          |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','一','二','三');
 least(1,2,3,4,5,6,7,'a','b','一','二','三') |
=================================================
                                              0 |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','c','1','2','1231213');
 least(1,2,3,4,5,6,7,'a','b','c','1','2','1231213') |
=====================================================
                                                  0 |

taos> select LEAST(1,2,3,4,5,6,7,'a','b','c','1','2','1231213','1231213.123123');
 least(1,2,3,4,5,6,7,'a','b','c','1','2','1231213','1231213.12312 |
===================================================================
                                                                0 |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint), cast(3 as int), cast(4 as bigint), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)));
 least(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint),  |
===================================================================
                                                               0 |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as smallint unsigned), cast(3 as int unsigned), cast(4 as bigint unsigned), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)));
 least(cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as sm |
===================================================================
                                                               0 |

taos> select LEAST(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint), cast(3 as int), cast(4 as bigint), cast(5 as float), cast(6 as double), cast(8 as varchar(20)), cast(9 as nchar(20)), cast(0 as bool), cast(1 as tinyint unsigned), cast(2 as smallint unsigned), cast(3 as int unsigned), cast(4 as bigint unsigned), cast(5 as float), cast(6 as double));
 least(cast(0 as bool), cast(1 as tinyint), cast(2 as smallint),  |
===================================================================
                                                               0 |

taos> select LEAST(cast(100 as tinyint), cast(101 as tinyint));
 least(cast(100 as tinyint), cast(101 as tinyint)) |
====================================================
                                               100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as smallint));
 least(cast(100 as tinyint), cast(101 as smallint)) |
=====================================================
                                                100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as int));
 least(cast(100 as tinyint), cast(101 as int)) |
================================================
                                           100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as bigint));
 least(cast(100 as tinyint), cast(101 as bigint)) |
===================================================
                                              100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as float));
 least(cast(100 as tinyint), cast(101 as float)) |
==================================================
                                             100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as double));
 least(cast(100 as tinyint), cast(101 as double)) |
===================================================
                                              100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as varchar(20)));
 least(cast(100 as tinyint), cast(101 as varchar(20))) |
========================================================
                                                   100 |

taos> select LEAST(cast(100 as tinyint), cast(101 as nchar(20)));
 least(cast(100 as tinyint), cast(101 as nchar(20))) |
======================================================
                                                 100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as tinyint));
 least(cast(101 as tinyint), cast(100 as tinyint)) |
====================================================
                                               100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as smallint));
 least(cast(101 as tinyint), cast(100 as smallint)) |
=====================================================
                                                100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as int));
 least(cast(101 as tinyint), cast(100 as int)) |
================================================
                                           100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as bigint));
 least(cast(101 as tinyint), cast(100 as bigint)) |
===================================================
                                              100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as float));
 least(cast(101 as tinyint), cast(100 as float)) |
==================================================
                                             100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as double));
 least(cast(101 as tinyint), cast(100 as double)) |
===================================================
                                              100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as varchar(20)));
 least(cast(101 as tinyint), cast(100 as varchar(20))) |
========================================================
                                                   100 |

taos> select LEAST(cast(101 as tinyint), cast(100 as nchar(20)));
 least(cast(101 as tinyint), cast(100 as nchar(20))) |
======================================================
                                                 100 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as smallint));
 least(cast(1000 as smallint), cast(1001 as smallint)) |
========================================================
                                                  1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as int));
 least(cast(1000 as smallint), cast(1001 as int)) |
===================================================
                                             1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as bigint));
 least(cast(1000 as smallint), cast(1001 as bigint)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as float));
 least(cast(1000 as smallint), cast(1001 as float)) |
=====================================================
                                               1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as double));
 least(cast(1000 as smallint), cast(1001 as double)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as varchar(20)));
 least(cast(1000 as smallint), cast(1001 as varchar(20))) |
===========================================================
                                                     1000 |

taos> select LEAST(cast(1000 as smallint), cast(1001 as nchar(20)));
 least(cast(1000 as smallint), cast(1001 as nchar(20))) |
=========================================================
                                                   1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as smallint));
 least(cast(1001 as smallint), cast(1000 as smallint)) |
========================================================
                                                  1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as int));
 least(cast(1001 as smallint), cast(1000 as int)) |
===================================================
                                             1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as bigint));
 least(cast(1001 as smallint), cast(1000 as bigint)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as float));
 least(cast(1001 as smallint), cast(1000 as float)) |
=====================================================
                                               1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as double));
 least(cast(1001 as smallint), cast(1000 as double)) |
======================================================
                                                1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as varchar(20)));
 least(cast(1001 as smallint), cast(1000 as varchar(20))) |
===========================================================
                                                     1000 |

taos> select LEAST(cast(1001 as smallint), cast(1000 as nchar(20)));
 least(cast(1001 as smallint), cast(1000 as nchar(20))) |
=========================================================
                                                   1000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as int));
 least(cast(1000000 as int), cast(1000001 as int)) |
====================================================
                                           1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as bigint));
 least(cast(1000000 as int), cast(1000001 as bigint)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as float));
 least(cast(1000000 as int), cast(1000001 as float)) |
======================================================
                                               1e+06 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as double));
 least(cast(1000000 as int), cast(1000001 as double)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as varchar(20)));
 least(cast(1000000 as int), cast(1000001 as varchar(20))) |
============================================================
                                                   1000000 |

taos> select LEAST(cast(1000000 as int), cast(1000001 as nchar(20)));
 least(cast(1000000 as int), cast(1000001 as nchar(20))) |
==========================================================
                                                 1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as int));
 least(cast(1000001 as int), cast(1000000 as int)) |
====================================================
                                           1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as bigint));
 least(cast(1000001 as int), cast(1000000 as bigint)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as float));
 least(cast(1000001 as int), cast(1000000 as float)) |
======================================================
                                               1e+06 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as double));
 least(cast(1000001 as int), cast(1000000 as double)) |
=======================================================
                                              1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as varchar(20)));
 least(cast(1000001 as int), cast(1000000 as varchar(20))) |
============================================================
                                                   1000000 |

taos> select LEAST(cast(1000001 as int), cast(1000000 as nchar(20)));
 least(cast(1000001 as int), cast(1000000 as nchar(20))) |
==========================================================
                                                 1000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as bigint));
 least(cast(1000000000 as bigint), cast(1000000001 as bigint)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as float));
 least(cast(1000000000 as bigint), cast(1000000001 as float)) |
===============================================================
                                                        1e+09 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as double));
 least(cast(1000000000 as bigint), cast(1000000001 as double)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as varchar(20)));
 least(cast(1000000000 as bigint), cast(1000000001 as varchar(20) |
===================================================================
                                                       1000000000 |

taos> select LEAST(cast(1000000000 as bigint), cast(1000000001 as nchar(20)));
 least(cast(1000000000 as bigint), cast(1000000001 as nchar(20))) |
===================================================================
                                                       1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as bigint));
 least(cast(1000000001 as bigint), cast(1000000000 as bigint)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as float));
 least(cast(1000000001 as bigint), cast(1000000000 as float)) |
===============================================================
                                                        1e+09 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as double));
 least(cast(1000000001 as bigint), cast(1000000000 as double)) |
================================================================
                                                    1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as varchar(20)));
 least(cast(1000000001 as bigint), cast(1000000000 as varchar(20) |
===================================================================
                                                       1000000000 |

taos> select LEAST(cast(1000000001 as bigint), cast(1000000000 as nchar(20)));
 least(cast(1000000001 as bigint), cast(1000000000 as nchar(20))) |
===================================================================
                                                       1000000000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as float));
 least(cast(100000.1111111 as float), cast(100001.1111111 as floa |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as double));
 least(cast(100000.1111111 as float), cast(100001.1111111 as doub |
===================================================================
                                                   100000.109375 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as timestamp));
 least(cast(100000.1111111 as float), cast(100001.1111111 as time |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as varchar(20)));
 least(cast(100000.1111111 as float), cast(100001.1111111 as varc |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as float), cast(100001.1111111 as nchar(20)));
 least(cast(100000.1111111 as float), cast(100001.1111111 as ncha |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as float));
 least(cast(100001.1111111 as float), cast(100000.1111111 as floa |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as double));
 least(cast(100001.1111111 as float), cast(100000.1111111 as doub |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as timestamp));
 least(cast(100001.1111111 as float), cast(100000.1111111 as time |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as varchar(20)));
 least(cast(100001.1111111 as float), cast(100000.1111111 as varc |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as float), cast(100000.1111111 as nchar(20)));
 least(cast(100001.1111111 as float), cast(100000.1111111 as ncha |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as double));
 least(cast(100000.1111111 as double), cast(100001.1111111 as dou |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as timestamp));
 least(cast(100000.1111111 as double), cast(100001.1111111 as tim |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as varchar(20)));
 least(cast(100000.1111111 as double), cast(100001.1111111 as var |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100000.1111111 as double), cast(100001.1111111 as nchar(20)));
 least(cast(100000.1111111 as double), cast(100001.1111111 as nch |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as double));
 least(cast(100001.1111111 as double), cast(100000.1111111 as dou |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as timestamp));
 least(cast(100001.1111111 as double), cast(100000.1111111 as tim |
===================================================================
                                                          100000 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as varchar(20)));
 least(cast(100001.1111111 as double), cast(100000.1111111 as var |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast(100001.1111111 as double), cast(100000.1111111 as nchar(20)));
 least(cast(100001.1111111 as double), cast(100000.1111111 as nch |
===================================================================
                                                  100000.1111111 |

taos> select LEAST(cast('中文测试' as varchar(20)), cast('中文测试一' as varchar(20)));
 least(cast('中文测试' as varchar(20)), cast('中文测试一 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试' as varchar(20)), cast('中文测试一' as nchar(20)));
 least(cast('中文测试' as varchar(20)), cast('中文测试一 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试一' as varchar(20)), cast('中文测试' as varchar(20)));
 least(cast('中文测试一' as varchar(20)), cast('中文测试 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('中文测试一' as varchar(20)), cast('中文测试' as nchar(20)));
 least(cast('中文测试一' as varchar(20)), cast('中文测试 |
===================================================================
 中文测试                                                         |

taos> select LEAST(cast('abc123abc' as varchar(20)), cast('abc124abc' as varchar(20)));
 least(cast('abc123abc' as varchar(20)), cast('abc124abc' as varc |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc123abc' as varchar(20)), cast('abc124abc' as nchar(20)));
 least(cast('abc123abc' as varchar(20)), cast('abc124abc' as ncha |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc124abc' as varchar(20)), cast('abc123abc' as varchar(20)));
 least(cast('abc124abc' as varchar(20)), cast('abc123abc' as varc |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc124abc' as varchar(20)), cast('abc123abc' as nchar(20)));
 least(cast('abc124abc' as varchar(20)), cast('abc123abc' as ncha |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast('abc123abc' as nchar(20)), cast('abc124abc' as nchar(20)));
 least(cast('abc123abc' as nchar(20)), cast('abc124abc' as nchar( |
===================================================================
 abc123abc                                                        |

taos> select LEAST(cast(100 as tinyint), cast(101 as float), cast(102 as varchar(20)));
 least(cast(100 as tinyint), cast(101 as float), cast(102 as varc |
===================================================================
                                                             100 |

taos> select LEAST(cast(100 as varchar(20)), cast(101 as float), cast(102 as tinyint));
 least(cast(100 as varchar(20)), cast(101 as float), cast(102 as  |
===================================================================
                                                             100 |

taos> select LEAST('a','b','c','d','e','f','g','h','1231','15155');
 least('a','b','c','d','e','f','g','h','1231','15155') |
========================================================
 1231                                                  |

taos> select LEAST(current, voltage, phase, id, nch1, nch2, var1, var2) from ts_4893.meters order by ts limit 10;
 least(current, voltage, phase, id, nch1, nch2, var1, var2) |
=============================================================
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |
                                                          0 |

taos> select LEAST(current, voltage, phase, id) from ts_4893.meters order by ts limit 10;
 least(current, voltage, phase, id) |
=====================================
                                  0 |
                            0.13883 |
                           0.796942 |
                            0.53733 |
                            0.31343 |
                           0.332767 |
                           0.846763 |
                           0.637813 |
                           0.115989 |
                           0.373575 |

taos> select LEAST(nch1, nch2, var1, var2) from ts_4893.meters order by ts limit 10;
 least(nch1, nch2, var1, var2)  |
=================================
 e                              |
 f                              |
 c                              |
 e                              |
 b                              |
 g                              |
 again                          |
 b                              |
 c                              |
 again                          |

taos> select LEAST(221, voltage) from ts_4893.meters order by ts limit 10;
  least(221, voltage)  |
========================
                   221 |
                   220 |
                   215 |
                   216 |
                   219 |
                   221 |
                   215 |
                   217 |
                   216 |
                   221 |

taos> select LEAST(5, id) from ts_4893.meters order by ts limit 10;
     least(5, id)      |
========================
                     0 |
                     1 |
                     2 |
                     3 |
                     4 |
                     5 |
                     5 |
                     5 |
                     5 |
                     5 |

taos> select LEAST('r', nch1) from ts_4893.meters order by ts limit 10;
        least('r', nch1)        |
=================================
 novel                          |
 r                              |
 r                              |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 r                              |
 novel                          |
 again                          |

taos> select LEAST('r', nch1, nch2) from ts_4893.meters order by ts limit 10;
     least('r', nch1, nch2)     |
=================================
 novel                          |
 f                              |
 c                              |
 prision                        |
 e                              |
 novel                          |
 again                          |
 d                              |
 c                              |
 again                          |

taos> select LEAST('r', var1) from ts_4893.meters order by ts limit 10;
        least('r', var1)        |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 r                              |
 r                              |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select LEAST('r', var1, var2) from ts_4893.meters order by ts limit 10;
     least('r', var1, var2)     |
=================================
 e                              |
 person                         |
 novel                          |
 e                              |
 b                              |
 g                              |
 b                              |
 b                              |
 e                              |
 plate                          |

taos> select LEAST('二中文测试', nch1) from ts_4893.meters order by ts limit 10;
 least('二中文测试', nch1) |
=================================
 novel                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 novel                          |
 novel                          |
 again                          |
 一二三四五六七八九十           |
 novel                          |
 again                          |

taos> select LEAST('二中文测试', nch1, nch2) from ts_4893.meters order by ts limit 10;
 least('二中文测试', nch1, nch2) |
=======================================
 novel                                |
 f                                    |
 c                                    |
 prision                              |
 e                                    |
 novel                                |
 again                                |
 d                                    |
 c                                    |
 again                                |

taos> select LEAST('二中文测试', var1) from ts_4893.meters order by ts limit 10;
 least('二中文测试', var1) |
=================================
 novel                          |
 person                         |
 novel                          |
 plate                          |
 一二三四五六七八九十           |
 update                         |
 prision                        |
 person                         |
 prision                        |
 plate                          |

taos> select LEAST('二中文测试', var1, var2) from ts_4893.meters order by ts limit 10;
 least('二中文测试', var1, var2) |
=======================================
 e                                    |
 person                               |
 novel                                |
 e                                    |
 b                                    |
 g                                    |
 b                                    |
 b                                    |
 e                                    |
 plate                                |

taos> select LEAST('23', 3443434343434343);
 least('23', 3443434343434343) |
================================
                            23 |

taos> select LEAST(co, 3443434343434343) from ts_4893.n1;
 least(co, 3443434343434343) |
==============================
                          23 |
                          23 |
                          23 |

taos> select LEAST('23', 3443434343434343) from ts_4893.n1;
 least('23', 3443434343434343) |
================================
                            23 |
                            23 |
                            23 |

taos> select LEAST('23', 1443434343434343) from ts_4893.n1;
 least('23', 1443434343434343) |
================================
                            23 |
                            23 |
                            23 |

taos> select LEAST(current, voltage) from ts_4893.n1;
 least(current, voltage) |
==========================
 NULL                    |
 NULL                    |
                       3 |

taos> select LEAST(current, voltage, '15') from ts_4893.n1;
 least(current, voltage, '15') |
================================
 NULL                          |
 NULL                          |
                             3 |

