
taos> select MOD(10.55, 3)
       mod(10.55, 3)       |
============================
                      1.55 |

taos> select MOD(10.55, 2)
       mod(10.55, 2)       |
============================
         0.550000000000001 |

taos> select MOD(10.55, 1)
       mod(10.55, 1)       |
============================
         0.550000000000001 |

taos> select MOD(10.55, -1)
      mod(10.55, -1)       |
============================
         0.550000000000001 |

taos> select MOD(10.55, -10)
      mod(10.55, -10)      |
============================
         0.550000000000001 |

taos> select MOD(-10.55, 1)
      mod(-10.55, 1)       |
============================
        -0.550000000000001 |

taos> select MOD(99, 1)
        mod(99, 1)         |
============================
                         0 |

taos> select MOD(10.55, 1) + 1
     mod(10.55, 1) + 1     |
============================
                      1.55 |

taos> select MOD(MOD(MOD(MOD(MOD(MOD(MOD(123.123456789, 9), 8), 7), 6), 5), 4), 3)
 mod(mod(mod(mod(mod(mod(mod(123.123456789, 9), 8), 7), 6), 5), 4 |
===================================================================
                                            1.234567890000022e-01 |

taos> select MOD(MOD(MOD(MOD(MOD(MOD(MOD(123456789.123456789, -1), -2), -3), -4), -5), -6), -7)
 mod(mod(mod(mod(mod(mod(mod(123456789.123456789, -1), -2), -3),  |
===================================================================
                                            1.234567910432816e-01 |

taos> select MOD(87654321.123456789, id + 1) from ts_4893.meters order by ts limit 10
 mod(87654321.123456789, id + 1) |
==================================
           1.234567910432816e-01 |
           1.123456791043282e+00 |
           1.234567910432816e-01 |
           1.123456791043282e+00 |
           1.123456791043282e+00 |
           3.123456791043282e+00 |
           6.123456791043282e+00 |
           1.123456791043282e+00 |
           1.234567910432816e-01 |
           1.123456791043282e+00 |

taos> select MOD(current, id + 1) from ts_4893.meters order by ts limit 10
   mod(current, id + 1)    |
============================
         0.649999618530273 |
         0.574000358581543 |
         0.795000076293945 |
          3.23299980163574 |
         0.706000328063965 |
          2.50800037384033 |
           2.5959997177124 |
          2.96199989318848 |
          2.22599983215332 |
         0.336999893188477 |

taos> select MOD(current, 1) from ts_4893.meters order by ts limit 10
      mod(current, 1)      |
============================
         0.649999618530273 |
         0.574000358581543 |
         0.795000076293945 |
         0.232999801635742 |
         0.706000328063965 |
         0.508000373840332 |
         0.595999717712402 |
         0.961999893188477 |
          0.22599983215332 |
         0.336999893188477 |

taos> select MOD(sqrt(current), abs(id + 1)) from ts_4893.meters order by ts limit 10
 mod(sqrt(current), abs(id + 1)) |
==================================
           2.634337159700784e-01 |
           9.281394021770111e-01 |
           1.296964830944782e-01 |
           3.351566768190027e+00 |
           3.272002495118848e+00 |
           2.916847677517688e+00 |
           3.097741066924800e+00 |
           3.310891102586806e+00 |
           3.350522322288470e+00 |
           3.215120509901375e+00 |

taos> select mod(10, -3)
        mod(10, -3)        |
============================
                         1 |

taos> select mod(10, 3)
        mod(10, 3)         |
============================
                         1 |

taos> select mod(id, 3) from ts_4893.d0 order by ts limit 10
        mod(id, 3)         |
============================
                         0 |
                         1 |
                         2 |
                         0 |
                         1 |
                         2 |
                         0 |
                         1 |
                         2 |
                         0 |

taos> select mod(id, 3) from ts_4893.meters order by ts limit 10
        mod(id, 3)         |
============================
                         0 |
                         1 |
                         2 |
                         0 |
                         1 |
                         2 |
                         0 |
                         1 |
                         2 |
                         0 |

taos> select mod(null, 2)
       mod(null, 2)        |
============================
 NULL                      |

taos> select mod(10, null)
       mod(10, null)       |
============================
 NULL                      |

taos> select mod(10, 0)
        mod(10, 0)         |
============================
 NULL                      |

taos> select mod(-10, 0)
        mod(-10, 0)        |
============================
 NULL                      |

taos> select mod(5, 0)
         mod(5, 0)         |
============================
 NULL                      |

taos> select mod(0, 1)
         mod(0, 1)         |
============================
                         0 |

taos> select mod(1, 1)
         mod(1, 1)         |
============================
                         0 |

taos> select mod(5, 2)
         mod(5, 2)         |
============================
                         1 |

taos> select mod(5, -3)
        mod(5, -3)         |
============================
                         2 |

taos> select mod(15, 4)
        mod(15, 4)         |
============================
                         3 |

taos> select mod(-5, 3)
        mod(-5, 3)         |
============================
                        -2 |

taos> select mod(voltage, 2) from ts_4893.meters limit 1
      mod(voltage, 2)      |
============================
                         1 |

taos> select mod(current, 10) from ts_4893.meters limit 1
     mod(current, 10)      |
============================
         0.649999618530273 |

taos> select mod(current, log(100)) from ts_4893.meters limit 1
  mod(current, log(100))   |
============================
          1.43965924655409 |

taos> select mod(phase, 4) from ts_4893.meters limit 1
       mod(phase, 4)       |
============================
         0.508898019790649 |

taos> select mod(abs(voltage), 3) from ts_4893.meters limit 1
   mod(abs(voltage), 3)    |
============================
                         2 |

taos> select mod(phase, sqrt(16)) from ts_4893.meters limit 1
   mod(phase, sqrt(16))    |
============================
         0.508898019790649 |

taos> select mod(round(voltage), 5) from ts_4893.meters limit 1
  mod(round(voltage), 5)   |
============================
                         1 |

