
taos> select pi()
           pi()            |
============================
          3.14159265358979 |

taos> select pi() + 1
         pi() + 1          |
============================
          4.14159265358979 |

taos> select pi() - 1
         pi() - 1          |
============================
          2.14159265358979 |

taos> select pi() * 2
         pi() * 2          |
============================
          6.28318530717959 |

taos> select pi() / 2
         pi() / 2          |
============================
           1.5707963267949 |

taos> select pi() from ts_4893.meters limit 5
           pi()            |
============================
          3.14159265358979 |
          3.14159265358979 |
          3.14159265358979 |
          3.14159265358979 |
          3.14159265358979 |

taos> select pi() + 1 from ts_4893.meters limit 1
         pi() + 1          |
============================
          4.14159265358979 |

taos> select pi() - 1 from ts_4893.meters limit 1
         pi() - 1          |
============================
          2.14159265358979 |

taos> select pi() * 2 from ts_4893.meters limit 1
         pi() * 2          |
============================
          6.28318530717959 |

taos> select pi() / 2 from ts_4893.meters limit 1
         pi() / 2          |
============================
           1.5707963267949 |

taos> select pi() + pi() from ts_4893.meters limit 1
        pi() + pi()        |
============================
          6.28318530717959 |

taos> select pi() - pi() from ts_4893.meters limit 1
        pi() - pi()        |
============================
                         0 |

taos> select pi() * pi() from ts_4893.meters limit 1
        pi() * pi()        |
============================
          9.86960440108936 |

taos> select pi() / pi() from ts_4893.meters limit 1
        pi() / pi()        |
============================
                         1 |

taos> select pi() + id from ts_4893.meters order by ts limit 5
         pi() + id         |
============================
          3.14159265358979 |
          4.14159265358979 |
          5.14159265358979 |
          6.14159265358979 |
          7.14159265358979 |

taos> select abs(pi())
         abs(pi())         |
============================
          3.14159265358979 |

taos> select pow(pi(), 2)
       pow(pi(), 2)        |
============================
          9.86960440108936 |

taos> select sqrt(pi())
        sqrt(pi())         |
============================
          1.77245385090552 |

taos> select cast(pi() as int)
 cast(pi() as int) |
====================
                 3 |

taos> select pi()
           pi()            |
============================
          3.14159265358979 |

taos> select substring_index(null, '.', 2)
 substring_index(null, '.', 2) |
================================
 NULL                          |

taos> select pi() + null
        pi() + null        |
============================
 NULL                      |

taos> select pi() * 0
         pi() * 0          |
============================
                         0 |

taos> select pi() / 0
         pi() / 0          |
============================
 NULL                      |

taos> select pi() * 0.5
        pi() * 0.5         |
============================
           1.5707963267949 |

taos> select pi() * -1
         pi() * -1         |
============================
         -3.14159265358979 |

taos> select pi() * name from ts_4893.meters limit 1
        pi() * name        |
============================
                         0 |

taos> select pi() * voltage from ts_4893.meters limit 1
      pi() * voltage       |
============================
          694.291976443344 |

taos> select pi() * phase * 2 from ts_4893.meters limit 1
     pi() * phase * 2      |
============================
          3.19750056080139 |

taos> select round(pi(), 6)
      round(pi(), 6)       |
============================
                  3.141593 |

taos> select round(pi() * phase, 2) from ts_4893.meters limit 1
  round(pi() * phase, 2)   |
============================
                       1.6 |

taos> select sqrt(pi() * voltage) from ts_4893.meters limit 1
   sqrt(pi() * voltage)    |
============================
          26.3494207990108 |

taos> select sqrt(current / pi()) from ts_4893.meters limit 1
   sqrt(current / pi())    |
============================
          1.84119530914887 |

taos> select abs(pi() * phase) from ts_4893.meters limit 1
     abs(pi() * phase)     |
============================
           1.5987502804007 |

taos> select log(pi() * voltage) from ts_4893.meters limit 1
    log(pi() * voltage)    |
============================
          6.54289258736715 |

taos> select voltage / pi() from ts_4893.meters limit 1
      voltage / pi()       |
============================
          70.3464848466177 |

taos> select id, case when voltage > 100 then pi() else pi() / 2 end from ts_4893.meters limit 1
     id      | case when voltage > 100 then pi() else pi() / 2 end |
====================================================================
           0 |                               3.141592653589793e+00 |

