
taos> select SIGN(0)
        sign(0)        |
========================
                     0 |

taos> select SIGN(1)
        sign(1)        |
========================
                     1 |

taos> select SIGN(1.5)
         sign(1.5)         |
============================
                         1 |

taos> select SIGN(100)
       sign(100)       |
========================
                     1 |

taos> select SIGN(-1)
       sign(-1)        |
========================
                    -1 |

taos> select SIGN(-1.5)
        sign(-1.5)         |
============================
                        -1 |

taos> select SIGN(-100)
      sign(-100)       |
========================
                    -1 |

taos> select SIGN(1) + 1
        sign(1) + 1        |
============================
                         2 |

taos> select SIGN(1) - 1
        sign(1) - 1        |
============================
                         0 |

taos> select SIGN(1) * 1
        sign(1) * 1        |
============================
                         1 |

taos> select SIGN(1) / 1
        sign(1) / 1        |
============================
                         1 |

taos> select SIGN(1) from ts_4893.meters limit 5
        sign(1)        |
========================
                     1 |
                     1 |
                     1 |
                     1 |
                     1 |

taos> select SIGN(1) + 1 from ts_4893.meters limit 1
        sign(1) + 1        |
============================
                         2 |

taos> select SIGN(1) - 1 from ts_4893.meters limit 1
        sign(1) - 1        |
============================
                         0 |

taos> select SIGN(1) * 2 from ts_4893.meters limit 1
        sign(1) * 2        |
============================
                         2 |

taos> select SIGN(1) / 2 from ts_4893.meters limit 1
        sign(1) / 2        |
============================
                       0.5 |

taos> select SIGN(2) + SIGN(1) from ts_4893.meters limit 1
     sign(2) + sign(1)     |
============================
                         2 |

taos> select SIGN(2) - SIGN(1) from ts_4893.meters limit 1
     sign(2) - sign(1)     |
============================
                         0 |

taos> select SIGN(2) * SIGN(1) from ts_4893.meters limit 1
     sign(2) * sign(1)     |
============================
                         1 |

taos> select SIGN(2) / SIGN(1) from ts_4893.meters limit 1
     sign(2) / sign(1)     |
============================
                         1 |

taos> select SIGN(1) + id from ts_4893.meters order by ts limit 5
       sign(1) + id        |
============================
                         1 |
                         2 |
                         3 |
                         4 |
                         5 |

taos> select SIGN(id) + id from ts_4893.meters order by ts limit 5
       sign(id) + id       |
============================
                         0 |
                         2 |
                         3 |
                         4 |
                         5 |

taos> select sign(cast(1 as tinyint))
 sign(cast(1 as tinyint)) |
===========================
                        1 |

taos> select sign(cast(1 as smallint))
 sign(cast(1 as smallint)) |
============================
                         1 |

taos> select sign(cast(1 as int))
 sign(cast(1 as int)) |
=======================
                    1 |

taos> select sign(cast(1 as bigint))
 sign(cast(1 as bigint)) |
==========================
                       1 |

taos> select sign(cast(1 as tinyint unsigned))
 sign(cast(1 as tinyint unsigned)) |
====================================
                                 1 |

taos> select sign(cast(1 as smallint unsigned))
 sign(cast(1 as smallint unsigned)) |
=====================================
                                  1 |

taos> select sign(cast(1 as int unsigned))
 sign(cast(1 as int unsigned)) |
================================
                             1 |

taos> select sign(cast(1 as bigint unsigned))
 sign(cast(1 as bigint unsigned)) |
===================================
                                1 |

taos> select sign(cast(1 as float))
 sign(cast(1 as float)) |
=========================
          1.0000000e+00 |

taos> select sign(cast(1 as double))
  sign(cast(1 as double))  |
============================
                         1 |

taos> select sign(cast(NULL as tinyint))
 sign(cast(null as tinyint)) |
==============================
 NULL                        |

taos> select sign(cast(NULL as smallint))
 sign(cast(null as smallint)) |
===============================
 NULL                         |

taos> select sign(cast(NULL as int))
 sign(cast(null as int)) |
==========================
 NULL                    |

taos> select sign(cast(NULL as bigint))
 sign(cast(null as bigint)) |
=============================
 NULL                       |

taos> select sign(cast(NULL as tinyint unsigned))
 sign(cast(null as tinyint unsigned)) |
=======================================
 NULL                                 |

taos> select sign(cast(NULL as smallint unsigned))
 sign(cast(null as smallint unsigned)) |
========================================
 NULL                                  |

taos> select sign(cast(NULL as int unsigned))
 sign(cast(null as int unsigned)) |
===================================
 NULL                             |

taos> select sign(cast(NULL as bigint unsigned))
 sign(cast(null as bigint unsigned)) |
======================================
 NULL                                |

taos> select sign(cast(NULL as float))
 sign(cast(null as float)) |
============================
 NULL                      |

taos> select sign(cast(NULL as double))
 sign(cast(null as double)) |
=============================
 NULL                       |

taos> select SIGN(abs(10))
     sign(abs(10))     |
========================
                     1 |

taos> select SIGN(abs(-10))
    sign(abs(-10))     |
========================
                     1 |

taos> select abs(SIGN(10))
     abs(sign(10))     |
========================
                     1 |

taos> select pow(SIGN(10), 2)
     pow(sign(10), 2)      |
============================
                         1 |

taos> select sqrt(SIGN(10))
      sqrt(sign(10))       |
============================
                         1 |

taos> select cast(SIGN(10) as int)
 cast(sign(10) as int) |
========================
                     1 |

taos> select SIGN(sqrt(id)) from ts_4893.meters order by ts limit 5
      sign(sqrt(id))       |
============================
                         0 |
                         1 |
                         1 |
                         1 |
                         1 |

taos> select SIGN(SIGN(SIGN(SIGN(0))))
 sign(sign(sign(sign(0)))) |
============================
                         0 |

taos> select sign(1)
        sign(1)        |
========================
                     1 |

taos> select sign(10)
       sign(10)        |
========================
                     1 |

taos> select sign(-1)
       sign(-1)        |
========================
                    -1 |

taos> select sign(-10)
       sign(-10)       |
========================
                    -1 |

taos> select sign(current) from ts_4893.d0 order by ts limit 10
    sign(current)     |
=======================
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |

taos> select sign(current) from ts_4893.meters order by ts limit 10
    sign(current)     |
=======================
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |
                    1 |

taos> select sign(cast(current as float)) from ts_4893.d0 order by ts limit 10
 sign(cast(current as float)) |
===============================
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |

taos> select sign(cast(current as float)) from ts_4893.meters order by ts limit 10
 sign(cast(current as float)) |
===============================
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |
                1.0000000e+00 |

taos> select sign(null)
      sign(null)       |
========================
 NULL                  |

taos> select sign(25)
       sign(25)        |
========================
                     1 |

taos> select sign(-10)
       sign(-10)       |
========================
                    -1 |

taos> select sign(0.1)
         sign(0.1)         |
============================
                         1 |

taos> select sign(-0.1)
        sign(-0.1)         |
============================
                        -1 |

taos> select sign(current) from ts_4893.meters limit 1
    sign(current)     |
=======================
                    1 |

taos> select sign(voltage) from ts_4893.meters limit 1
 sign(voltage) |
================
             1 |

taos> select sign(phase) from ts_4893.meters limit 1
     sign(phase)      |
=======================
                    1 |

taos> select sign(abs(voltage)) from ts_4893.meters limit 1
 sign(abs(voltage)) |
=====================
                  1 |

taos> select sign(round(current)) from ts_4893.meters limit 1
 sign(round(current)) |
=======================
                    1 |

taos> select sign(sqrt(voltage)) from ts_4893.meters limit 1
    sign(sqrt(voltage))    |
============================
                         1 |

taos> select sign(log(current + 1)) from ts_4893.meters limit 1
  sign(log(current + 1))   |
============================
                         1 |

