
taos> select WEEK('2020-01-01 00:00:00')
 week('2020-01-01 00:00:00') |
==============================
                           0 |

taos> select WEEK('2020-01-01 00:00:00', 0)
 week('2020-01-01 00:00:00', 0) |
=================================
                              0 |

taos> select WEEK('2020-01-01 00:00:00', 1)
 week('2020-01-01 00:00:00', 1) |
=================================
                              1 |

taos> select WEEK('2020-01-01 00:00:00', 2)
 week('2020-01-01 00:00:00', 2) |
=================================
                             52 |

taos> select WEEK('2020-01-01 00:00:00', 3)
 week('2020-01-01 00:00:00', 3) |
=================================
                              1 |

taos> select WEEK('2020-01-01 00:00:00', 4)
 week('2020-01-01 00:00:00', 4) |
=================================
                              1 |

taos> select WEEK('2020-01-01 00:00:00', 5)
 week('2020-01-01 00:00:00', 5) |
=================================
                              0 |

taos> select WEEK('2020-01-01 00:00:00', 6)
 week('2020-01-01 00:00:00', 6) |
=================================
                              1 |

taos> select WEEK('2020-01-01 00:00:00', 7)
 week('2020-01-01 00:00:00', 7) |
=================================
                             52 |

taos> select WEEK('2021-01-01 00:00:00')
 week('2021-01-01 00:00:00') |
==============================
                           0 |

taos> select WEEK('2021-01-01 00:00:00', 0)
 week('2021-01-01 00:00:00', 0) |
=================================
                              0 |

taos> select WEEK('2021-01-01 00:00:00', 1)
 week('2021-01-01 00:00:00', 1) |
=================================
                              0 |

taos> select WEEK('2021-01-01 00:00:00', 2)
 week('2021-01-01 00:00:00', 2) |
=================================
                             52 |

taos> select WEEK('2021-01-01 00:00:00', 3)
 week('2021-01-01 00:00:00', 3) |
=================================
                             53 |

taos> select WEEK('2021-01-01 00:00:00', 4)
 week('2021-01-01 00:00:00', 4) |
=================================
                              0 |

taos> select WEEK('2021-01-01 00:00:00', 5)
 week('2021-01-01 00:00:00', 5) |
=================================
                              0 |

taos> select WEEK('2021-01-01 00:00:00', 6)
 week('2021-01-01 00:00:00', 6) |
=================================
                             53 |

taos> select WEEK('2021-01-01 00:00:00', 7)
 week('2021-01-01 00:00:00', 7) |
=================================
                             52 |

taos> select WEEK('1998-01-01 00:00:00')
 week('1998-01-01 00:00:00') |
==============================
                           0 |

taos> select WEEK('1998-01-01 00:00:00', 0)
 week('1998-01-01 00:00:00', 0) |
=================================
                              0 |

taos> select WEEK('1998-01-01 00:00:00', 1)
 week('1998-01-01 00:00:00', 1) |
=================================
                              1 |

taos> select WEEK('1998-01-01 00:00:00', 2)
 week('1998-01-01 00:00:00', 2) |
=================================
                             52 |

taos> select WEEK('1998-01-01 00:00:00', 3)
 week('1998-01-01 00:00:00', 3) |
=================================
                              1 |

taos> select WEEK('1998-01-01 00:00:00', 4)
 week('1998-01-01 00:00:00', 4) |
=================================
                              0 |

taos> select WEEK('1998-01-01 00:00:00', 5)
 week('1998-01-01 00:00:00', 5) |
=================================
                              0 |

taos> select WEEK('1998-01-01 00:00:00', 6)
 week('1998-01-01 00:00:00', 6) |
=================================
                             53 |

taos> select WEEK('1998-01-01 00:00:00', 7)
 week('1998-01-01 00:00:00', 7) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00')
 week('1998-12-31 00:00:00') |
==============================
                          52 |

taos> select WEEK('1998-12-31 00:00:00', 0)
 week('1998-12-31 00:00:00', 0) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00', 1)
 week('1998-12-31 00:00:00', 1) |
=================================
                             53 |

taos> select WEEK('1998-12-31 00:00:00', 2)
 week('1998-12-31 00:00:00', 2) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00', 3)
 week('1998-12-31 00:00:00', 3) |
=================================
                             53 |

taos> select WEEK('1998-12-31 00:00:00', 4)
 week('1998-12-31 00:00:00', 4) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00', 5)
 week('1998-12-31 00:00:00', 5) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00', 6)
 week('1998-12-31 00:00:00', 6) |
=================================
                             52 |

taos> select WEEK('1998-12-31 00:00:00', 7)
 week('1998-12-31 00:00:00', 7) |
=================================
                             52 |

taos> select WEEK('2000-01-06 00:00:00')
 week('2000-01-06 00:00:00') |
==============================
                           1 |

taos> select WEEK('2000-01-06 00:00:00', 0)
 week('2000-01-06 00:00:00', 0) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 1)
 week('2000-01-06 00:00:00', 1) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 2)
 week('2000-01-06 00:00:00', 2) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 3)
 week('2000-01-06 00:00:00', 3) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 4)
 week('2000-01-06 00:00:00', 4) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 5)
 week('2000-01-06 00:00:00', 5) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 6)
 week('2000-01-06 00:00:00', 6) |
=================================
                              1 |

taos> select WEEK('2000-01-06 00:00:00', 7)
 week('2000-01-06 00:00:00', 7) |
=================================
                              1 |

taos> select WEEK(1725095657)
   week(1725095657)    |
========================
                     3 |

taos> select WEEK(1725095657, 0)
  week(1725095657, 0)  |
========================
                     3 |

taos> select WEEK(1725095657, 1)
  week(1725095657, 1)  |
========================
                     4 |

taos> select WEEK(1725095657, 2)
  week(1725095657, 2)  |
========================
                     3 |

taos> select WEEK(1725095657, 3)
  week(1725095657, 3)  |
========================
                     4 |

taos> select WEEK(1725095657, 4)
  week(1725095657, 4)  |
========================
                     3 |

taos> select WEEK(1725095657, 5)
  week(1725095657, 5)  |
========================
                     3 |

taos> select WEEK(1725095657, 6)
  week(1725095657, 6)  |
========================
                     3 |

taos> select WEEK(ts) from ts_4893.meters order by ts limit 10
       week(ts)        |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 0) from ts_4893.meters order by ts limit 10
      week(ts, 0)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 1) from ts_4893.meters order by ts limit 10
      week(ts, 1)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 2) from ts_4893.meters order by ts limit 10
      week(ts, 2)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 3) from ts_4893.meters order by ts limit 10
      week(ts, 3)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 4) from ts_4893.meters order by ts limit 10
      week(ts, 4)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 5) from ts_4893.meters order by ts limit 10
      week(ts, 5)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 6) from ts_4893.meters order by ts limit 10
      week(ts, 6)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select WEEK(ts, 7) from ts_4893.meters order by ts limit 10
      week(ts, 7)      |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select week(123)
       week(123)       |
========================
                     0 |

taos> select week('2000-01-01',0)
 week('2000-01-01',0)  |
========================
                     0 |

taos> select week('2000-01-01',1)
 week('2000-01-01',1)  |
========================
                     0 |

taos> select week('2000-01-01',2)
 week('2000-01-01',2)  |
========================
                    52 |

taos> select week('2000-01-01',3)
 week('2000-01-01',3)  |
========================
                    52 |

taos> select week('2000-01-01',4)
 week('2000-01-01',4)  |
========================
                     0 |

taos> select week('2000-01-01',5)
 week('2000-01-01',5)  |
========================
                     0 |

taos> select week('2000-01-01',6)
 week('2000-01-01',6)  |
========================
                    52 |

taos> select week('2000-01-01',7)
 week('2000-01-01',7)  |
========================
                    52 |

taos> select week(1721020591,0)
  week(1721020591,0)   |
========================
                     3 |

taos> select week('2020-01-01 00:00:00', 2)
 week('2020-01-01 00:00:00', 2) |
=================================
                             52 |

taos> select week(ts) from ts_4893.d0 order by ts limit 10
       week(ts)        |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select week(ts) from ts_4893.meters order by ts limit 10
       week(ts)        |
========================
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |
                    28 |

taos> select week(null, 0)
     week(null, 0)     |
========================
 NULL                  |

taos> select week('abc')
      week('abc')      |
========================
 NULL                  |

taos> select week('1721020591', 0)
 week('1721020591', 0) |
========================
 NULL                  |

taos> select week('1721020666229', 0)
 week('1721020666229', 0) |
===========================
 NULL                     |

taos> select week('20200101', 2)
  week('20200101', 2)  |
========================
 NULL                  |

taos> select week('11/01/31', 2)
  week('11/01/31', 2)  |
========================
 NULL                  |

taos> select week('20/01/01', 2)
  week('20/01/01', 2)  |
========================
 NULL                  |

taos> select week('01/01/2020', 2)
 week('01/01/2020', 2) |
========================
 NULL                  |

taos> select week('01-JAN-20', 2)
 week('01-JAN-20', 2)  |
========================
 NULL                  |

taos> select week('2023-09-25')
  week('2023-09-25')   |
========================
                    39 |

taos> select week('9999-12-31')
  week('9999-12-31')   |
========================
                    52 |

taos> select week('2024-02-29 00:00:00')
 week('2024-02-29 00:00:00') |
==============================
                           8 |

taos> select week(ts) from ts_4893.meters limit 1
       week(ts)        |
========================
                    28 |

taos> select week(name) from ts_4893.meters limit 1
      week(name)       |
========================
 NULL                  |

taos> select week(ts), dayofweek(ts) from ts_4893.meters limit 1
       week(ts)        |     dayofweek(ts)     |
================================================
                    28 |                     6 |

taos> select week(timediff(ts, '2024-10-10 09:36:50.172')) from ts_4893.meters limit 1
 week(timediff(ts, '2024-10-10 09:36:50.172')) |
================================================
                                            39 |

taos> select id, week(ts) from ts_4893.meters where id = 1 limit 1
     id      |       week(ts)        |
======================================
           1 |                    28 |

taos> select groupid, sum(week(ts)) from ts_4893.meters group by groupid
 groupid |     sum(week(ts))     |
==================================
       1 |               2669490 |

